[
    {
        "complaintid": "1j08tvi",
        "title": "How I Fought & Won Against HDFC After 4 Months of Struggle",
        "description": "\nI’m sharing my frustrating experience with HDFC Bank, hoping it might help others facing a similar issue. My account was debit-freezed at the end of October 2024 because my transactions supposedly didn’t match my student profile. What followed was months of harassment, incompetence, and bureaucratic nonsense.\n\nTimeline of Events:\n\nOctober 2024: My account got frozen. I visited the branch the next day. A bank employee asked about my transactions, and after explaining, she said only the manager could lift the freeze.\n\nManager’s Response: Instead of helping, he immediately accused me of fraud and money laundering. I asked what steps I needed to take to remove the freeze. His response? “Your account will remain frozen. I will not lift it.”\n\nHDFC Website Complaint: I raised a query and received a response saying I needed to submit income proof. Since I’m a student, I provided my father’s payslip.\n\nManager’s Reaction: He refused to accept my father’s payslip, saying, “I need your income proof, provide 3 years of ITR returns if you want the freeze lifted.” (Ridiculous for a student, right?)\n\nOne Month Later: My father and I visited the branch again, hoping for a resolution. My father politely asked, “Sir, a mistake has been made. What’s the solution?”\n\nManager’s Response? He shouted in front of customers and staff, calling me a criminal. My father got angry and asked for a solution, but the manager said, “Do whatever you want, I won’t lift the freeze.” He even threatened us by saying he knew the local SHO and that we’d have to go to the police station.\n\nDecember: I raised a grievance with HDFC, but they closed my complaint, falsely stating it was resolved (because the manager lied).\n\nEnd of December: I finally filed a complaint through RBI CMS (should’ve done this earlier). 8 days later, a branch employee called me and said, “Submit an account closure form to lift the freeze.”\n\nI asked why I needed to close my account.\n\nShe replied, “It’s the only way.”\n\nI demanded an official email about this, and she actually sent one.\n\n\nManager’s Next Move: After my RBI complaint, the same manager called me politely for a discussion.\n\nHe again insisted I close my account.\n\nI refused, saying I just wanted the freeze lifted.\n\nHe said, “Okay, you can go.”\n\n\nJanuary: I got another email from the bank asking me to submit income proof. I replied that I already tried, but the manager refused to accept it.\n\nMid-January: RBI replied that my complaint was closed because the bank falsely told them I wasn’t providing documents. I lost all hope.\n\nFebruary: I submitted my father’s payslip again to a different employee, who assured me my account would be unfrozen. 15 days later, I received a rejection email:\n\n“Your account will remain frozen as the payslip is not in your name.”\n\nThey again pressured me to close my account.\n\n\nFed up, I complained to CPGRAMS & DPG.\n\n2 days later, the manager called my father and threatened him to close my account. My father refused.\n\nI updated my CPGRAMS complaint to include the manager’s harassment and misconduct.\n\n\n\nFinally, A Resolution (After 4 Months!)\n\nToday, an HDFC employee visited my house for “home verification.” He was polite and said my account would be unfrozen in 3-4 days.\n\nHe later called and pressured me to send an email stating my issue was resolved.\n\nI refused, saying I wouldn’t do it until the freeze was actually lifted.\n\nHe insisted that I send another mail to \"initiate the process.” I said, “Send me an official email first.” He declined. So, I also refused to send anything.\n\nAfter a few more calls, he said, “I’ll try to get it done today.”\n\nAnd finally… my account was unfrozen!\n\n\n\nTL;DR: HDFC Bank froze my student account unfairly, accused me of fraud, refused to accept my father’s payslip, pressured me to close my account, and lied to grievance departments. After months of fighting through RBI, CPGRAMS, and DPG complaints, I finally got my account unfrozen.\n\n",
        "date": "2025-02-28",
        "author": "khattapaani",
        "url": "https://www.reddit.com/r/india/comments/1j08tvi/how_i_fought_won_against_hdfc_after_4_months_of/",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1i0cd5q",
        "title": "Blinkit Thinks They're Above Consumer Laws - Is Marking Unresolved Consumer Complaints as 'Resolved' Not Criminal? Blinkit Seems to Think So",
        "description": "\"It was just a bottle of ketchup.\"\n\nThat's what I thought when I ordered from Blinkit on January 4th, 2025. Little did I know this Rs. 198 purchase would expose a company's elaborate scheme designed to defraud customers and mock our consumer protection laws.\n\nHere's how it started:\n\n* Ordered ketchup from Blinkit - Rs. 198\n* Same product everywhere else - Rs. 104\n* Tried refusing delivery - Their staff wouldn't allow it\n* Customer service too refused to take it back but rather promised larger quantity replacement (have it on call recording)\n* Promise never fulfilled\n\nWhat happened next exposed their entire fraudulent system...\n\nTHE TIMELINE OF DECEPTION:\n\nFirst complaint: Price gouging (Rs. 198 vs market price Rs. 104)  \nTheir response: \"Product was delivered\" - IGNORING the price issue\n\nSecond complaint: Highlighted their ignoring of price gouging  \nTheir response: \"Duplicate case, see first unresolved complaint\"\n\nhttps://preview.redd.it/14fj78p13rce1.png?width=1111&format=png&auto=webp&s=581defeb5bb14dc2c6dda02fb0968af0e9908232\n\nThird through TWELFTH complaints: Each highlighting their fraudulent practices  \nTheir response: Copy-paste \"Already resolved in complaint #1\" (WHICH WAS NEVER RESOLVED)\n\nTWELVE SEPARATE COMPLAINTS on the official Consumer Helpline portal. TWELVE TIMES they've fraudulently marked complaints as \"resolved\" while referencing an unresolved complaint. This isn't just bad customer service - this is WILLFUL MISCONDUCT:\n\nhttps://preview.redd.it/xwne0l543rce1.png?width=1120&format=png&auto=webp&s=334b14a242d7f7113c5866ad9918674124410139\n\nTHEIR SYSTEMATIC FRAUD & PRICE GOUGING SCAM:\n\n* 90% price gouging on basic items (Rs. 396 charged for Rs. 208 worth products)\n* Delivery staff PREVENTING returns at delivery\n* False promises of replacement/resolution\n* TWELVE fraudulent complaint closures on official government portal\n* Creating fake resolution paper trail through circular referencing\n\nIF IT'S NOT A WILLFUL FRAUD, THEN WHAT IS IT - FALSE COMPLAINT RESOLUTION:\n\n* The Consumer Protection Act mandates proper grievance redressal\n* Blinkit marks complaints as \"resolved\" without any resolution\n* Deliberately references unresolved complaints as \"resolved\"\n* Creates fraudulent paper trail of false resolutions\n* Direct violation of the Consumer Protection Act\n\nTHEIR SYSTEMATIC LEGAL VIOLATIONS:\n\n* Excessive pricing without justification\n* Preventing rightful returns during delivery\n* Making false promises of replacement/resolution\n* Fraudulent marking of complaints as resolved\n* Creating circular reference system to exhaust consumers\n* Violating basic consumer rights guaranteed by law\n\nTHEIR DECEPTIVE COMPLAINT HANDLING:\n\n* File complaint about price gouging\n* They close it saying \"product delivered\"\n* File new complaint\n* \"Already resolved in previous complaint\" (WHICH WAS NEVER RESOLVED)\n* Every new complaint met with same fraudulent response\n* Clear violation of Consumer Protection Act's grievance redressal requirements\n\nLEGAL IMPLICATIONS:\n\n* Fraudulent marking of unresolved complaints = Willful misrepresentation\n* Circular referencing system = Deliberate suppression of consumer rights\n* False promises of resolution = Violation of unfair trade practice laws\n* Preventing returns = Violation of consumer rights\n* 90% markup without justification = Unfair pricing practice\n\nQuestions for Blinkit's Legal Team:\n\n* How is marking unresolved complaints as \"resolved\" not fraud?\n* How does your circular complaint system comply with Consumer Protection Act?\n* Why train staff to prevent legally entitled returns?\n* How do you justify 90% markup under pricing regulations?\n\nConsumer Protection Act 2019 exists for a reason. Blinkit's systematic violation of every consumer protection guideline shows they think they're above the law.\n\nEvery false resolution is another violation. Every circular reference is evidence of systematic fraud.",
        "date": "2025-01-13",
        "author": "luckyankit",
        "url": "https://www.reddit.com/r/india/comments/1i0cd5q/blinkit_thinks_theyre_above_consumer_laws_is/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1i9q72p",
        "title": "I got 40 km expressway cleaned using CPGRAMS portal!",
        "description": "TL;DR - I asked the highway department in WB to clean the expressway to prevent accident and buy cleaning machines to keep the highway clean and they actually did it!\n\nHey guys want to share another great news this weekend with you guys. If you remember, [I shared last week how I got WBSEDCL to improve their service with my email](https://www.reddit.com/r/india/comments/1i4yc3p/i_potentially_improved_the_lives_of_203_crore/). I travelled last month via a newly built expressway in WB. I rarely use this road but its very well made expressway. A huge shoutout to WBHDCL(West Bengal Highway Authority) for making such an amazing expressway.\n\nWhile travelling I found a issue on the entire stretch of the highway. The highway was not maintained very well. The highway was collecting dust and white sand and was accumulating on the side of the highway and when cars used to go at high speed, it was being spread on the road back again which was causing skidding in vehicles. This was a serious issue and though I don't use it much I thought I should inform about this to WBHDCL to help reduce accidents. I wrote a small complain with some suggestions to clean the road daily and buy cleaning machine to properly handle dust and sand accumulation on the road via CPGRAMS portal. \n\nI visited the expressway this week and saw people cleaning and collecting dust with broom and hand shovel at a crossing. I was happy to see it but I thought it would have been better if they used cleaning machines but atleast they are cleaning it now. 10km ahead I saw it, a road cleaning machine attached to a tractor, it wasn't the modern cleaning machines seen in the city but it was not spreading the dust and sand and actually picking it properly(Pic attached, not original pic but similar, as I wasn't able to stop and take pic on expressway) I was so happy to see the road lanes cleared of sand. I complained to them a month ago and they actually took it positively and took action. The expressway has been open for quite a few months but this is the first time I saw cleaning machines deployed. It is highly possible that they already had plans on cleaning the roads but I never saw it cleaned before I complained so I believe my suggestions nudged them to take action to clean the road and prevent accidents. There is still a lot of sands at merging intersection and some other parts of the expressway but the main highway and its sidelines are mostly clean now, hoping they keep it up and clean everything soon.\n\nMoral of the story - If you find a problem please take action, please complain to the correct authority, please do something. If nothing just shoot an email to the govt, 80% chance they won't check it but the other 20% is a big deal, what if they actually read it and get it fixed like the above case. My complaint possibly saved hundreds from accident as roads are clean and free of sand. If you are stuck in traffic, have roads filled with potholes, garbage on the road etc. don't sit back and accept it, tell the govt you want it fixed, they will fix things when people actually demand it. \n\nMy reason for sharing all these things are to show the people how easy it can be to bring change, you might not even have to step out of your home to bring change and improve lives of lakhs of people in India, all I ask you is to be selfish and complain for the things that only matter to you, complain for only the roads you travel by, cleanliness in the area you travel by daily. I see people thinking I am some activist trying to bring change but that is far from the truth. I am a simple man working 9-5 with no connections or influence. All that is different between me and the rest is that when I face a problem like bad roads, potholes, garbage problem etc, I take 5 mins out of my time and tell the govt there is a problem and ask them to fix it. I don't go around fixing all the problems in WB or Banglore or any other state when I visit it, all I try to fix are the things that bother me, if everyone does the same, every neighbourhood would improve drastically in India.",
        "date": "2025-01-25",
        "author": "the-velvethunder",
        "url": "https://www.reddit.com/gallery/1i9q72p",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1it0bbj",
        "title": "📢CPGRAMS REALLY WORKS (I made NHAI to correct an unpaved road within one month in Bengaluru)",
        "description": "Before and after (work has started)\n\nI watched a reel on Instagram from *Labour Law Advisor* that explained how to file complaints about various issues with the central government. Curious to try it out, I filed a grievance about an unpaved road at Jalahalli Cross, Bengaluru, which had remained in poor condition since my first year of engineering (I’m currently in my final year). The road caused significant dust pollution in the area.  \n\nTo my surprise, within a month of filing the complaint, I received a response stating that work on the road had begun, along with photo evidence. I felt extremely happy to see the impact of my complaint.  \n\nThis should reach everyone! I encourage everyone to use CPGRAMS to resolve various civic issues effectively.",
        "date": "2025-02-19",
        "author": "Gargantua1729",
        "url": "https://www.reddit.com/gallery/1it0bbj",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1htb99t",
        "title": "93Mobiles is a scam, pls don't purchase anything from there.",
        "description": "Hi all,\n\nI'm raising awareness about [**https://www.93mobiles.com/**](https://www.93mobiles.com/) **scam**.\n\nI recently purchased a hard disk since it was on discount on this site, worth 4500/-. I did not receive any updates over SMS / email / WhatsApp. When I tried contacting their custom care number through WhatsApp and call, but there was no reply, and even the number is invalid (as per operators).\n\nThe second grievance number displayed on their [Grievance Officer - 93Mobiles](https://www.93mobiles.com/grievance-officer/) page, is of Myntra and when I looked at Myntra's grievance page, I realized that it's definitely a scam, since they copied Myntra's grievance page as it is.\n\nBelow is Myntra's grievance page [Grievance Redressal Mechanism | Myntra](https://www.myntra.com/grievanceredressal)\n\n[Myntra's grievance page](https://preview.redd.it/zp816etw8yae1.png?width=1033&format=png&auto=webp&s=353c587f77ca4828724f206c93140624c459816e)\n\nBelow is 93Mobile's [Grievance Officer - 93Mobiles (Scam)](https://www.93mobiles.com/grievance-officer/)\n\npage\n\n[93Mobiles \\(scam\\) grievance page](https://preview.redd.it/tz2t77089yae1.png?width=810&format=png&auto=webp&s=e7b9ac0efaa6ecb6ddff8162c0760223b6e82ed4)\n\nI'm going to raise a cybercrime complaint about it. And possible try to get their payment-gateway blocked.",
        "date": "2025-01-04",
        "author": "Ankur4015",
        "url": "https://www.reddit.com/r/india/comments/1htb99t/93mobiles_is_a_scam_pls_dont_purchase_anything/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1iw54vc",
        "title": "Flipkart doesn’t provide bill separately for extended warranty you buy for laptop, isn’t this sort of illegal?",
        "description": "Hello guys!\n\nIn short Flipkart sucks - in their app they don’t have option to cancel the insurance you buy for laptop separately. I have lost 5k and more importantly time I wasted explaining same thing to various agent again and again who don’t even know how their app works.\n\nI ordered a laptop (Sep 29 2024) from Flipkart along with 3 year complete protection warranty for the laptop. I received defective laptop,\nwhen I tried requesting for refund it was cancelled citing something about seller refusing to refund the amount. I was told\nby Flipkart customer support to contact the brand of laptop for refund. I then contacted Lenovo and received the refund for the\nlaptop. I was also told by Flipkart customer support that once I receive refund from brand then Flipkart will initiate the process\nfor cancelling the 3 year complete warranty. \n\nI was then told by Flipkart to contact Jevees for the refund and they said to contact Flipkart for the same. Now, Flipkart is denying refund for that citing laptop hasn’t been returned via Flipkart.\n\nI filed a company on consumer helpline website this was their response:\n\nHi, Greetings from Flipkart! Order ID: OD432445499764556100 We are sorry for the trouble caused. We certainly understand your concern. We would like to inform you that since the product was delivered on 05 Oct 24, it is post 10 day Return policy. Due to this sorry to inform you that the seller will not be able to initiate the refund request of the product. Hence, closing the complaint from our end as per the policy. Your kind understanding and cooperation are appreciated. Thank you.\n\nThe case has been disposed by consumer complaint this was their response: \n\nThe Company has responded to your grievance. If you are not\nsatisfied with the company\nresponse and want to pursue the\ncase with the company for further\nrelief/ compensation in the\nabsence of suitable/ acceptable\nredressal, you may file a case at the\ndesignated Consumer Commission\nonline. Please visit https://e-\njagriti.gov.in/\n\nLet me know if I can do anything now. Please raise this issue on Twitter because I think this seems very generic and many customers must have faced the same.\n\nThanks for reading!",
        "date": "2025-02-23",
        "author": "Kira06052001",
        "url": "https://www.reddit.com/r/india/comments/1iw54vc/flipkart_doesnt_provide_bill_separately_for/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1iouue9",
        "title": "TRAI: The Toothless Regulator Failing Indian Consumers",
        "description": "The Telecom Regulatory Authority of India (TRAI) was established in 1997 with the responsibility of ensuring a fair, transparent, and consumer-friendly telecom sector. However, in recent years, TRAI has become a spectator rather than a regulator, often bowing to corporate interests while failing to safeguard the rights of Indian consumers. From unfair pricing and data throttling to the failure to rein in telecom monopolies, TRAI’s track record is riddled with inaction and inefficiency.\n\n1. The Jio Monopoly and TRAI’s Complicity\n\nOne of the biggest failures of TRAI has been its mishandling of the telecom competition landscape, particularly in its response to Reliance Jio’s market dominance. While Jio’s entry in 2016 disrupted the industry with free services and ultra-cheap plans, it crushed competition due to predatory pricing. Companies like Aircel, Tata Docomo, and Telenor collapsed, while Vodafone and Idea were forced into a struggling merger.\n\nTRAI stood by and allowed Jio to dictate market terms, resulting in a virtual duopoly between Jio and Bharti Airtel. The regulator failed to:\n\nEnforce fair competition rules to prevent the monopolization of the telecom industry.\n\nProtect smaller players from being forced out.\n\nPrevent the rise of cartel-like pricing, which is now evident as data prices have steadily increased post-Jio’s consolidation of market power.\n\n\n2. Consumer Grievances: Apathy and Inaction\n\nIndian consumers face numerous telecom-related issues, from spam calls and SMS scams to misleading recharge plans and poor network quality. TRAI has done little to curb these problems:\n\nSpam Calls & SMS Fraud: Despite several directives, Indians continue to be bombarded with fraud calls and promotional spam. The Do-Not-Disturb (DND) service is a joke, with most calls coming from telemarketers using personal numbers.\n\nCall Drops & Poor Network: Network quality remains abysmal, especially in smaller towns and rural areas. Despite promising strict action, TRAI has failed to penalize telecom operators adequately for poor service.\n\nMisleading Recharge Plans: Telecom companies continue to introduce vague and deceptive recharge plans. Many plans now include a \"service validity\" clause that forces users to recharge every 28 days instead of a full month, effectively increasing costs for consumers.\n\n\n3. The Net Neutrality Farce\n\nTRAI once took a strong stance on net neutrality, blocking Facebook’s Free Basics and Airtel Zero in 2016. However, in recent years, it has remained silent as telecom companies introduce disguised violations of net neutrality, such as:\n\nOffering bundled content plans where certain streaming services get preferential data rates.\n\nFavoring their own OTT (over-the-top) platforms, indirectly discouraging competition.\n\n\nThis selective enforcement raises serious questions about whether TRAI is truly independent or just a puppet for powerful corporate interests.\n\n4. 5G and Broadband: Regulatory Chaos\n\nTRAI’s handling of 5G rollout and broadband expansion has been sluggish and confused. Despite tall claims, India’s 5G experience remains patchy, and there’s no clear framework for quality control.\n\n5G Speeds & Coverage Are Unreliable: Unlike global markets, where 5G is a game-changer, Indian telecom providers are selling it as an expensive gimmick with inconsistent speeds.\n\nBroadband Pricing Is Arbitrary: The lack of regulation allows ISPs to charge unreasonably high prices for inconsistent speeds, often under \"fair usage\" policies that throttle connections.\n\n\n5. TRAI’s Cozy Relationship With Telecom Giants\n\nTRAI’s failure to regulate pricing and quality of service suggests that it is more interested in protecting telecom companies’ profits than ensuring fair pricing and service for consumers.\n\nInstead of ensuring fair pricing, it has allowed tariff hikes under the excuse of \"industry sustainability.\"\n\nIt has refused to intervene in anti-competitive practices, such as price collusion between telecom giants.\n\nIt has failed to prevent telcos from passing spectrum costs onto consumers, leading to rising bills.\n\n\nA Regulator in Name Only\n\nTRAI was supposed to be a watchdog for consumers, but today it is little more than a lapdog for telecom corporations. Instead of ensuring affordable, high-quality telecom services, it has enabled the rise of a duopoly, ignored consumer complaints, and failed to enforce net neutrality.\n\nIf TRAI does not take urgent corrective measures, India’s telecom sector will continue on its path toward corporate-driven exploitation, where consumers are forced to pay more for subpar services. It is time for the government to either reform TRAI or replace it with a truly independent regulatory body that serves the interests of Indian consumers, not telecom giants.\n\n",
        "date": "2025-02-13",
        "author": "Any-Satisfaction-232",
        "url": "https://www.reddit.com/r/india/comments/1iouue9/trai_the_toothless_regulator_failing_indian/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1is99ez",
        "title": "🚨 KIIT University’s Hypocrisy 🚨After forcefully evicting Nepali students following the tragic death of Prakriti Lamsal, KIIT University is now calling them back just because Nepal embassy officials are visiting to assess the situation. They tried to suppress the issue, but now they’re scrambling.",
        "description": "",
        "date": "2025-02-18",
        "author": "tapendar",
        "url": "https://v.redd.it/d81oo5gobuje1",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1i0aqkx",
        "title": "On being requested to solve issues with school, Delhi's BJP CM candidate questions the parents on their decision to have kids.",
        "description": "Parents: Please resolve issues with school or our childrens future will be ruined\n\nRamesh Bidhuri : Why did you have children?\n\nSource: https://x.com/sphavisha/status/1878414212399022592\n\n",
        "date": "2025-01-13",
        "author": "earthling011",
        "url": "https://v.redd.it/mktxdzwoiqce1",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1ie919m",
        "title": "Man Leaves India Despite Passport Being In Court Custody; Supreme Court Asks Centre How He Managed To Leave; Issues Arrest Warrant",
        "description": "Court is blind to privileges of certain peeps",
        "date": "2025-01-31",
        "author": "pranagrapher",
        "url": "https://www.livelaw.in/top-stories/man-leaves-india-despite-passport-being-in-court-custody-supreme-court-asks-centre-how-he-managed-to-leave-issues-arrest-warrant-282523",
        "location": "India",
        "predicted_category": "Public Safety & Police"
    },
    {
        "complaintid": "1i2jttw",
        "title": "Steve Job’s wife leaves Kumbh mela due to allergy issues",
        "description": "",
        "date": "2025-01-16",
        "author": "bhodrolok",
        "url": "https://www.thestatesman.com/india/steve-jobs-wife-leaves-kumbh-mela-due-to-allergy-issues-1503387147.html",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1il830o",
        "title": "The Western world's Air Quality Index (AQI) seems relatively stable despite their rapid development, whereas India's AQI chart is alarming. Why isn't the government prioritizing this critical issue? Shouldn't we, as responsible citizens, demand action and hold them accountable?",
        "description": "The Western world's Air Quality Index (AQI) seems relatively stable despite their rapid development, whereas India's AQI chart is alarming. Why isn't the government prioritizing this critical issue? Shouldn't we, as responsible citizens, demand action and hold them accountable?",
        "date": "2025-02-09",
        "author": "Majestic_____kdj",
        "url": "https://www.reddit.com/gallery/1il830o",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1ival9p",
        "title": "MP: 4 years after his home was demolished over rape complaint, Muslim man acquitted by court",
        "description": "",
        "date": "2025-02-22",
        "author": "_Baazigar",
        "url": "https://maktoobmedia.com/india/mp-4-years-after-his-home-was-demolished-over-rape-complaint-muslim-man-acquitted-by-court/",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iyd2pl",
        "title": "Boy, his parents held, their shop razed after complaint over slogans during India-Pakistan match",
        "description": "",
        "date": "2025-02-26",
        "author": "_Baazigar",
        "url": "https://indianexpress.com/article/cities/mumbai/boy-his-parents-held-their-shop-razed-after-complaint-over-slogans-during-india-pak-match-9856419/",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1i4udnm",
        "title": "These Rooms Give Young Indian Lovers Rare Privacy. Cue the Complaints.",
        "description": "",
        "date": "2025-01-19",
        "author": "telephonecompany",
        "url": "https://www.nytimes.com/2025/01/19/world/asia/india-oyo.html",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1idrqwg",
        "title": "BJP's auditor seems to have issues with independence",
        "description": "ICAI, the institute for regulating chartered accountants, has always boasted about independence and ethics. So much that we have fixed weightage on the topic at every level of the exam. ",
        "date": "2025-01-30",
        "author": "user7-0",
        "url": "https://www.reddit.com/gallery/1idrqwg",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1ireke3",
        "title": "'Unfair to think China is the enemy': Sam Pitroda downplays China threat, says issue 'blown out of proportion'",
        "description": "",
        "date": "2025-02-17",
        "author": "Adorable-Puff",
        "url": "https://www.moneycontrol.com/news/india/unfair-to-think-china-is-the-enemy-sam-pitroda-downplays-china-threat-says-issue-blown-out-of-proportion-12942366.html",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iw1pc4",
        "title": "India’s Real Problems Are Its People—Change My Mind",
        "description": "Let’s cut the crap. We love blaming politicians, the system, or even “Western influence,” but here’s the harsh reality: **India’s biggest problem is its own people.** Yeah, I said it. If that offends you, maybe it’s because it hits too close to home. Ready for some uncomfortable truths?\n\n# 1. We’re All Corrupt Hypocrites\n\nWe bribe traffic cops, pay under-the-table fees, and dodge taxes—but we cry about corruption in politics. **You can’t complain about dirty hands when yours are covered in mud.**\n\n# 2. Fake Morality and Double Standards\n\nWe scream about “Indian values” but have the highest rates of domestic violence, rape, and dowry deaths. **Our so-called culture is rotten with hypocrisy.**\n\n# 3. Education = Memorization, Not Intelligence\n\nOur education system is a joke. Memorize, regurgitate, forget—repeat. No creativity, no critical thinking. **We produce degrees, not minds.**\n\n# 4. Log Kya Kahenge: The Real Dream Killer\n\nThis toxic mentality is responsible for countless broken dreams and mental health issues. **We care more about societal approval than happiness.** What a sad way to live.\n\n# 5. ‘Patriotism’ = Blind Nationalism\n\nWe mistake blind loyalty for patriotism. If someone criticizes the country, they’re “anti-national.” **Loving your country means wanting it to improve, not worshipping it blindly.**\n\n# 6. Religion: Dividing More Than It Unites\n\nReligion here isn’t about faith—it’s about identity, superiority, and moral policing. **We kill in the name of gods we don’t even truly understand.**\n\n# 7. Casteism: The Stain We Pretend Doesn’t Exist\n\nWe claim to be modern but still judge people by their caste, even on dating apps. **Newsflash: If you believe in caste, you’re part of the problem.**\n\n# 8. Victim Mentality and Excuse Culture\n\nWe love to complain but hate taking responsibility. Blame the government, the West, society, fate—**everyone except ourselves.**\n\n# 9. No Civic Sense, No Shame\n\nWe spit, litter, and piss on roads without a second thought. **We treat our public spaces like garbage bins.** And then we cry about pollution and bad infrastructure.\n\n# 10. Misogyny Is in Our DNA\n\nWe say we respect women but slut-shame, victim-blame, and objectify them every chance we get. **Your “Indian culture” isn’t as pure as you think.**\n\n**\"Yesterday I was smart and tried to change the world, Today I am wise so I try to change myself.\"**\n\nFor clarification:I’m not saying every Indian is like this, but these issues are too widespread to ignore. If you love your country, prove it by being better.  \nIt’s easy to point fingers, but change starts with us.",
        "date": "2025-02-23",
        "author": "CurrentBridge7237",
        "url": "https://www.reddit.com/r/india/comments/1iw1pc4/indias_real_problems_are_its_peoplechange_my_mind/",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1iu7ogl",
        "title": "I want to leave india.",
        "description": "And when I say I want to, people start protesting \"You hate your country haww, so you are just wasting our resources?\" Bitch I pay for them\n\nYou want to know why I want to leave? You want to act like questioning the state of things makes me some kind of traitor? Fine. Let's go step by step because apparently, blind patriotism is easier than confronting reality.\n\nLet’s start with the latest outrage—the Supreme Court telling Ranveer Allahbadia that his jokes would \"make women feel ashamed.\" Oh, so now we care about women’s dignity? When it’s about a guy cracking jokes, suddenly the system wants to step in and be the moral police. But when it’s about something that actually matters—marital rape? Silence. Absolute, deafening silence. You know what’s legal here? A man forcing himself on his wife, because apparently, marriage is a free pass for assault. But sure, let’s focus on jokes. Let’s spend our time on the big issues like comedy instead of, I don’t know, the fact that rapists walk free, that women have to beg for justice, that survivors are shamed while criminals get sympathy.\n\nAnd since we’re talking about priorities, let’s talk about law and order in general. Every week, a new case of some rich, powerful guy committing a crime and getting away with it. Drunk drivers mowing down people? Political connections will fix it. A celebrity gets caught doing something illegal? Don’t worry, a PR campaign will clear their image. A regular person, though? Get ready to rot in the system. There’s no justice here—just a game where the rich and connected win, and the rest of us pretend we live in a functioning democracy.\n\nBut let’s not stop there. Let’s talk about the culture—because this country prides itself on being “progressive” while clinging to ideas that should’ve died centuries ago. Ever since this Ranveer Allahbadia controversy, it’s been clearer than ever that we’re not moving forward—we’re stuck. Our definition of progress is adding more shopping malls while keeping the same regressive mindsets alive. Women still get judged for what they wear. Inter-caste or interfaith couples still get harassed. Parents still control their kids like they own them, shoving them into careers they hate because “log kya kahenge” (what will people say). And god forbid you question tradition—because the moment you do, you're suddenly disrespecting \"Bharatiya sanskriti\" (Indian culture).\n\nLet’s move on to infrastructure, or rather, the lack of it. My parents pay their taxes, but where does that money go? Because it’s sure as hell not going into roads. I don’t even live in some remote village—I live in a developed town. But apparently, \"developed\" means nothing, because the nearest McDonald's is 17 kilometers away. And sure, it’s not about McDonald's itself—it’s about how basic infrastructure is still a joke. Potholes, traffic that moves slower than a dying snail, and an internet speed that makes you question if you’re still in 2025 or if you time-traveled back to 2008.\n\nAnd then there’s education. A system that rewards memorization over intelligence. A system where creativity is crushed and students are pushed into engineering or medicine like cattle, with no regard for what they actually want. You’re not taught to think—you’re taught to obey. Schools don’t prepare you for life; they prepare you to be a replaceable cog in an overpopulated machine. And if you dare to dream outside the conventional path? Good luck explaining that to your family, because in their eyes, success is a government job or an IIT degree.\n\nThen we have the economy. Oh, you want to build wealth? Well, good luck, because if you're not born into it, you're in for a lifelong struggle. Wages are low, the cost of living is rising, and everything is taxed to death. Want to start a business? Get ready to drown in bureaucratic nonsense and corruption. Want to invest? Hope you enjoy government policies changing overnight, killing industries with zero warning. And if you somehow manage to make money, guess what? You’re still at the mercy of outdated financial policies and a stock market that swings like a drunk pendulum.\n\nAnd finally, the biggest hypocrisy of all—if I want to leave, suddenly I’m the villain? Suddenly, I “hate my country”? No. I don’t hate my country—I hate what it has become. I hate that questioning these things makes people defensive instead of introspective. I hate that people refuse to acknowledge reality because it’s easier to pretend everything is fine. I hate that I have to explain why wanting a better life isn’t a betrayal.\n\nBut sure, keep calling me ungrateful. Keep telling me that \"no country is perfect,\" as if that excuses everything. Keep pretending that patriotism means blind obedience instead of demanding better. And while you do that, I’ll be making my way to a place that values progress over empty pride.\n\n",
        "date": "2025-02-20",
        "author": "lame_dude_",
        "url": "https://www.reddit.com/r/india/comments/1iu7ogl/i_want_to_leave_india/",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1isgx8n",
        "title": "Consumer court directs PVR INOX to pay Rs 1 lakh to Bengaluru man after complaint about excessive ads before movies",
        "description": "",
        "date": "2025-02-18",
        "author": "intelnk",
        "url": "https://indianexpress.com/article/entertainment/bollywood/consumer-court-directs-pvr-inox-to-pay-over-rs-1-lakh-for-excessive-ads-before-movies-9843165/",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iav11y",
        "title": "Decided to renounce my Indian citizenship after 10 years of waiting and believing",
        "description": "I’m living abroad for many years. The initial plan was to come here (got a scholarship) and go back home. \nI went back every year to see my family and I was disappointed every single year. Nothing changed significantly in the many years that I had left home. I was one of those people who believed that India had a future. I was not exactly patriotic but believed in our potential to become a strong nation. Instead, I have seen that we have become so backward in so many areas. The brain drain is real. \nWe lack the basics, the air got worse, we have issues with water, corruption exists and thrives in every walk of life and the gap between the rich and the poor keeps increasing. There’s misinformation being spread rampantly, our news channels are exhausting. The time I go home once a year, I can’t stand watching the news. There used to be a time where there were journalists doing real journalism and intellectual debates. \nThe only thing I still do is watch Bollywood films. Somehow comforts me and is my way of dealing with missing home. I see youth chasing the wrong things, our education system doesn’t encourage innovation and so much more. Every time I’m home, some relative or friend has a young person talking to me about their future. They all want to leave. They don’t know why they picked a certain field of study. There’s a general lack of passion. \nI could have gotten a better passport years ago but I waited. My heart felt like it could get better but I’ve given up. It’s done for me. I’ve renounced my Indian citizenship. \nWe are such a beautiful country, with such a rich history and colourful culture, but that’s not enough for this 30 something year old to believe in. I’m sad and happy at the same time. I’ve made it.. but have I really ? \n\nImportant: I’m getting flooded with requests of people who want to leave. \nOn the other hand I’m also getting hate. I don’t know if this matters but I’m a woman. I wanted to be safe and feel free. I know I don’t need to justify myself but still, it played a key role in me leaving! ",
        "date": "2025-01-27",
        "author": "beautifullifede",
        "url": "https://www.reddit.com/r/india/comments/1iav11y/decided_to_renounce_my_indian_citizenship_after/",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iln0f0",
        "title": "In Race to Build Metro Trains, How Indian Cities Ignored Larger Mobility Issue",
        "description": "",
        "date": "2025-02-09",
        "author": "Inevitable-Hunt737",
        "url": "https://www.thequint.com/videos/public-transport-problem-in-indian-cities-traffic-metro-trains-buses",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1ifptcq",
        "title": "Kerala court issues non-bailable arrest warrant against Ramdev, Balkrishna over non-appearance in misleading ads case",
        "description": "",
        "date": "2025-02-02",
        "author": "DioTheSuperiorWaifu",
        "url": "https://www.deccanherald.com/india/kerala/kerala-court-issues-non-bailable-arrest-warrant-against-ramdev-balkrishna-over-non-appearance-in-misleading-ads-case-3385325",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iiaxes",
        "title": "MoH obesity poster uses Churchil silhouette",
        "description": "",
        "date": "2025-02-05",
        "author": "AdFit5807",
        "url": "https://i.redd.it/gd0vs6u6xbhe1.jpeg",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1hzsblt",
        "title": "I hate the fact that India is so untrustworthy.",
        "description": "\nWhen you go to the shop to buy some products, the shopkeeper quotes most of the items at very high prices and when you ask for a reduction, he tells hundred lies to not to reduce the price. \n\nBuy any product online and you have to see the seller ratings. You have to differentiate between fake or real reviews. Even after checking everything, it is not guaranteed that the product will be delivered an unused or has real parts replaced with cheap ones. \n\nReal paneer, milk is hardly ever to be seen. Restaurants selling fat spead as butter.  Adulteration in food products is rampant. \n\nGo to a used car dealer to puchase a car and ready to get scammed. That's just inevitable. \n\n\nFew times bike and car worshop workers  offered me stolen parts of other vehicles in discount even in authorised service centers. You can't even sit in peace while having your vehicle serviced because these people can't be trusted completely. \n\nOur politicians and corporate leaders want to convince people that they work 18 hours a day so everyone should follow them for development of the country but how many of us are allowed to visit temples, a dying friend in hospital, parents on birthdays in those working hours like them.\n \n\nI recently saw lots of videos on youtube and reddit posts on how rampant is dishonesty in our society. Famous IAS officers using disability quota by showing fake disability certificates, goons creating fake documents to capture someone's land, bribes in government offices is a part of our system, meter tampering at petrol pumps, stealing of lpg gas from cylinders by distributer and hundreds of online, phone scams. If you don't take precautions while dealing with these things then some say the issue is with you because you trusted your fellow countrymen on what they supposed to do. \n\nWhen the British was capturing India, so many times they found official of Indian kingdoms who were ready to betray their kings for some money and power  but why Indian kings couldn't found even a single British soldier who betrayed his army despite our kings having so much wealth. I don't think it will never happen again because we still have people like those. \n\nI lost patriotism and I don't feel anything when I hear national anthem. National flag is just a piece of cloth for me now. \n\n Why are we doing this to each other? Will we ever become a high trust society like Europe and Japan?\n\nEdit- I don't hate India, I just hate that how common and easy to cheat each other in our society. When I see most developed countries where most Indian want to live as permanent citizen those are one of the top trustable societies in the world. So, sometimes I imagine how much better our country will become if we create a more trustable society. \n\nFew people are saying these kind of things also happens in europe, america. Can someone tell me, Is their judicial system also rotting like India? Their policemen take bribes? Their court judges are always ready to give verdict in favour of party who gives them bribes means it nearly impossible to win against rich? ",
        "date": "2025-01-12",
        "author": "Separate_Lecture_782",
        "url": "https://www.reddit.com/r/india/comments/1hzsblt/i_hate_the_fact_that_india_is_so_untrustworthy/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1i146tq",
        "title": "Toilet issue resolved: Inside Rs 55,000 Cr Vande Bharat sleeper trains",
        "description": "",
        "date": "2025-01-14",
        "author": "1-randomonium",
        "url": "https://www.indiatoday.in/information/story/toilet-issue-resolved-inside-rs-55000-cr-vande-bharat-sleeper-trains-2663354-2025-01-11",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1ip6y0z",
        "title": "PM Modi on Adani: Modi Declines to Comment on Adani Issue in Front of Trump",
        "description": "",
        "date": "2025-02-14",
        "author": "PenPrudent5435",
        "url": "https://youtu.be/uVbr5sPnJGI",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1ihrfqp",
        "title": "\"Indian passport - No entry\"",
        "description": "Travel isn’t always smooth sailing, but I never expected to be outright denied entry without a proper explanation.  \n\nA few days ago, I was planning to visit Famagusta in the Turkish Republic of Northern Cyprus (TRNC).I took the road from Southern Cyprus and reached the Deryneia border crossing, expecting a routine check. Instead, the border officer took one look at my Indian passport and said:  \n\n\"Indian passport holders are not allowed.\" \n\nJust like that. No reason, no further questions. Meanwhile, the two European travelers with me walked through without a hitch.  \n\nI was confused—because just two days earlier, I had entered TRNC through the Nicosia border crossing without any issue. When I mentioned this, the officer shouted at me: \n \n\"I don’t care. This is a new rule; the rules have changed now.\" \n\nHe was rude, dismissive, and wouldn’t explain further.  \n\nTrying to get some clarity, I later emailed the TRNC Ministry of Foreign Affairs specifically about requirements for Indian passport holders. Their response made things even more confusing:  \n\n\" Please be advised that except for Syrian, Nigerian, or Armenian passport holders, there is no requirement to obtain a visa prior to travel to TRNC.\"  \n\nSo… what exactly happened at the border?  \n\nI had :  \n-A passport valid for 9 more years   \n-Return flight tickets \n-Sufficient funds & confirmed hotel bookings \n\n(Also a Schengen visa & UK permanent residency.)\n\nBut none of that mattered because the officer didn’t even check.  \n\nOut of curiosity, I looked up the Google reviews for the Turkish side of this border crossing, and I wasn’t alone. In the 1-star reviews, I found another traveler describing almost the exact same experience. \n\nHonestly, the whole thing felt unfair.  Whatever the reason, being singled out like that left a bad taste in my mouth.  \n\nHas anyone else had a similar experience? Would love to hear your thoughts.  ",
        "date": "2025-02-04",
        "author": "Brugiamalayi",
        "url": "https://www.reddit.com/r/india/comments/1ihrfqp/indian_passport_no_entry/",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1ihbvdc",
        "title": "Bengaluru cab driver and woman argue over navigation issue: ‘The girl has anxiety issues’ says internet",
        "description": "",
        "date": "2025-02-04",
        "author": "SwatCatsDext",
        "url": "https://www.hindustantimes.com/trending/bengaluru-cab-driver-and-woman-argue-over-navigation-issue-the-girl-has-anxiety-issues-says-internet-101738645607665.html",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1is3jvp",
        "title": "Summary of what happened at KIIT University",
        "description": "\\[To not get harrased by police: I will say, treat this as fiction, use discression. All of the info below may be fake. In India, I don't wanna get death threats\\]\n\n1. Boyfriend abused, harassed and blackmailed nepali girl\n2. Girl reported it to International Relations Office (IRO) a month ago, who brushed her off.\n3. Girl committed suicide on 16th Feb while everyone else was at a concert.\n4. Boyfriend tried to flee via plane but gets arrested at the airport.\n5. Hostel wardens take custody of the body before the police could intervene.\n6. Body sent to KIMS for postmortem without the family's consent.\n7. Students who were protesting peacefully were beaten up and locked in their hostels.\n8. Nepali students broke into the girls hostel to demand answers from the wardens.\n9. Teachers yell at nepali students saying \"Founder sir spends money to feed 40,000 children, which is more than your country's budget.\", \"If you're not safe here, then go where you are safe. Go home. I shouldn't see a single one of you here again.\" 10. College suspends ALL the Nepali students Sine Die without any tickets for them to go anywhere and fills them up in buses forcefully only to strand them at the railway station. (Girls too)\n10. Students are getting beaten up in lathi charges, being yelled at, being abused, boys and girls alike. 12. All the hostels have been put on lockdown in an attempt to supress any more protests.\n\n\n\nHere's exactly what happened: Advik blackmailed his ex-girlfriend, a Nepali student, into sending him nudes and having sex with him by threatening to leak their sex tape. The girl committed suicide after enduring prolonged abuse. The university tried to send Advik back home, but police caught him at the airport. The warden removed the girl's body without notifying the police, possibly tampering with evidence. The girl's phone and laptop, containing crucial evidence, are missing. Despite numerous complaints, the university took no action against Advik, who is the son of a politician. KIIT issued a notice for Nepali students to vacate the hostels, possibly to downplay the incident.",
        "date": "2025-02-18",
        "author": "iam_wizard",
        "url": "https://www.reddit.com/r/india/comments/1is3jvp/summary_of_what_happened_at_kiit_university/",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1hx74qy",
        "title": "EC seems to have enrolled 16 lakh more voters than entire adult population in Maharashtra: Congress rakes up voter issue again",
        "description": "",
        "date": "2025-01-09",
        "author": "puddi_tat",
        "url": "https://www.deccanherald.com/india/ec-apparently-enrolled-16-lakh-more-voters-than-entire-adult-population-in-maharashtra-congress-3346711",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iopsiq",
        "title": "BIZARRE: Assam Court summons Man for Reacting ‘Haha’ on Facebook comment.",
        "description": "A man from Dhekiajuli, Assam was summoned by court for reacting ‘Haha’ on a Facebook comment.\n\nThe man is identified as Amit Chakraborty residing in Dhekiaji, who had to appear before the Kokrajhar district court today after being accused in a case filed by an IAS officer, the former Deputy Commissioner of Kokrajhar.\n\nReportedly, the IAS officer received a comment from a Facebook user named Naresh Barua, who wrote, “No makeup today, ma’am?” \n\nIn response to this comment, Amit Chakraborty simply reacted with a laughing emoji. \n\nHowever, this act led to a legal case being filed against him. Following the complaint, the case was registered at Kokrajhar police station.\n\nAs a result, Amit Chakraborty had to travel all the way from Dhekiajuli to Kokrajhar to apply for bail in the district court.\n\nAmit Chakraborty expressed his disbelief, stating, “I didn’t even know who the Deputy Commissioner was. I can’t understand how an IAS officer found the time to take such extreme action over something so trivial.”\n\nHowever, while Chakraborty was finally granted bail, the incident raises important questions about freedom of speech and expression on facebook.",
        "date": "2025-02-13",
        "author": "brawler_r",
        "url": "https://v.redd.it/j9jbv56v8yie1",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1ix0bjz",
        "title": "Why in the world is Sanskrit still being taught in schools?",
        "description": "I don't mean to offend anyone, but I just don't understand a purpose for continuing to teach Sanskrit. No one speaks Sanskrit any more. It's basically an extinct language at this point. \n\nI understand that Sanskrit is historically and culturally significant, but teaching it as a mandatory subject is just unnecessary when kids could be learning languages that they can actually use in daily life. \n\nHours and hours are wasted on Sanskrit, when the teachers themselves can't speak it fluently. Even if they could, what of it? What purpose does it serve? The vast majority of children just slog through the textbooks to pass their board exams and then never think of Sanskrit ever again. \n\nI learned Sanskrit for 5 years, but I can't remember a single Sanskrit word. Most of Sanskrit taught in schools focuses on rote memorization instead of on actually developing a deep understanding of the language. Children just memorise Sanskrit question-answers like a script, so what's the point? \n\nWhy continue to force this mostly dead language on kids who are already stressed enough as it is? Like, what is the practical purpose? I don't see the language making a comeback ever again. Sanskrit had its time. It's mostly dead now. Why continue to beat a dead horse? \n\nEdit: People are mass downvoting and acting like I have a personal grudge against Sanskrit. Guys, I'm not against Sanskrit or our cultural heritage. I'm all for us learning about our history and traditions, but the way Sanskrit is being taught in schools now, IT IS ABSOLUTELY USELESS. All it's doing is adding to students' burden. Continuing to teach Sanskrit in this manner is not going to revive the language. Sanskrit teachers don't know shit about the language they're teaching. Most Sanskrit teachers only have surface level knowledge of the subject. This is just added stress serving no real purpose. Either remove it, or reform the way it's being taught. Or, you could make it an optional subject instead. Not sure why people think I'm hating India by expressing this opinion. \n\nEdit2: Haha, people have resorted to name calling and insulting my intelligence for the comment I made that I don't remember any Sanskrit. Very nice, everyone. \n\nDid you not read anything I wrote? I've already said the focus is more on rote learning, and guess what people forget things learned that way. You can actually express an opinion without resorting to name calling and insults like animals. You won't change anyone's mind by insulting them. You all are coming at me like a pack of rabid dogs. \n\nSomeone name calls and I just lose all respect for them and stop trusting their judgement. What is it about this topic that's making you so angry you're sending me vile DMs? I'm just some rando. I'm not omnipotent wiping out Sanskrit as a whole from existence. My opinion does not matter in the slightest and will not affect any educational policies whatsoever bro move on with your life. Don't be angry.",
        "date": "2025-02-24",
        "author": "Lenore8264",
        "url": "https://www.reddit.com/r/india/comments/1ix0bjz/why_in_the_world_is_sanskrit_still_being_taught/",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1i1sbig",
        "title": "As Another Indian Is Killed in Ukraine War, India ‘Strongly’ Raises Issue With Russia",
        "description": "",
        "date": "2025-01-15",
        "author": "telephonecompany",
        "url": "https://thewire.in/diplomacy/india-strongly-raises-with-russia-national-killed-in-ukraine-war",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1i4xnv0",
        "title": "Kerala Court Issues Arrest Warrant Against Ramdev Over Alleged Misleading Advertisements",
        "description": "",
        "date": "2025-01-19",
        "author": "DioTheSuperiorWaifu",
        "url": "https://thewire.in/article/law/kerala-court-issues-arrest-warrant-against-ramdev-over-alleged-misleading-advertisements",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1j38mvb",
        "title": "Yes, India has a very long way to go with respect to women's safety (terrifying experience in Shimla)",
        "description": "My best friend and I (two girls) have been traveling together from 2023. I just returned back from a trip to Shimla. We usually walk around a lot and explore places covering atleast 16K-20K steps a day during trips. Both of us have realised we stumble upon a lot of precious gems like hidden markets, local events, etc. which otherwise would have been missed. \n\nThe second day, as my friend was posing for a picture near a place with a scenic view, somewhere outside the bylanes of Lower Bazaar, a group of men walked by. I saw one of them look at my friend up and down so vulgarly, it gave me, who was standing at a distance, chills (before people jump here and comment on our clothes, because that is what happens, we went there when the temperature was touching 5 degrees. We were covered (not that it matters, cause we have anyway seen babies getting raped in this goddamn country). He did not realise I was at a distance clicking her picture so when he turned around, he directly met my eyes and I hope he saw how much I wanted to puke on him.\n\nThe same night after dinner, around 9, we were returning to our hotel. Our hotel is at a little distance from the mall road. While we were walking towards the mall road, a man came up stinking of alcohol and passed us into the opposite direction. A while later, we turned around and saw him following us. We sat down on a seat in a very lighted area to just check if he was following us. Viola! He came and sat in the adjacent seat. \n\nTrust me, so many thoughts ran to my mind within seconds. I screamed at my friend 'Lets go' and we got up within a minute of him sitting down. I think my scream was so loud, it intimidated him a bit as he realised we were not afraid to make noise and alert people. All the way to the hotel, we ran down, checking our backs. \n\nIn 2023, I visited Vietnam with the same friend. We roamed the entire night exploring places without feeling threatened even once. Now, I am not foolish enough to say that other countries dont have crimes. I know the importance of being alert in all places. However, the level of audacity and lack of fear I see in men here when it comes to making women afraid, helpless and harrassing them is alarming. \n\nI wish people in our country were more focused on severe issues plaguing our country like women safety than stupid matters that hog them TRPs. \n\nI genuinely do not think I will solo travel anywhere after this as I had plans to try traveling alone. \n\nTLDR: Terrifying experience as a female traveler in Shimla\n\nEdit: In both these incidents, it weren't the locals that made us feel unsafe. Both incidents had tourist men in question. ",
        "date": "2025-03-04",
        "author": "Ponderer1111",
        "url": "https://www.reddit.com/r/india/comments/1j38mvb/yes_india_has_a_very_long_way_to_go_with_respect/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1i4drzn",
        "title": "Bengaluru Burglary: Spaniards SOS Call Cut Short Over Language Issue",
        "description": "",
        "date": "2025-01-18",
        "author": "Narayan_22",
        "url": "https://timesofindia.indiatimes.com/city/bengaluru/with-burglars-in-flat-spaniards-call-tocops-cut-for-not-speaking-kannada/articleshow/117339492.cms",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iqkozt",
        "title": "700 cases of ragging incidents are registered as complaints every year",
        "description": "",
        "date": "2025-02-16",
        "author": "TheMapsDaily",
        "url": "https://www.reddit.com/gallery/1iqkozt",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1ikhx0m",
        "title": "So this is how temple/darga structures pop ups right in middle of our roads?",
        "description": "I came across this setup just outside the city where major development is planned. It’s clear this is the beginning of a temple structure, right in the middle of a future major road. The inevitable result will be traffic havoc and accidents.\n\nWhy do our people keep doing this? Isn’t it disrespectful to our gods to have their images left on a roadside like this? It’s dusty, exposed, and bound to cause unnecessary problems.\n\nWhy don’t the authorities stop this before it becomes a full-blown issue? There must be better ways to show devotion that don’t involve creating safety risks or complicating urban planning. What are your thoughts?\n",
        "date": "2025-02-08",
        "author": "thebigt",
        "url": "https://www.reddit.com/gallery/1ikhx0m",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1i3iw46",
        "title": "I think I have rabies",
        "description": "So It all started on 26th December, my sister recently adopted a stray cat bit by dogs which was unvaccinated. We had chicken for dinner and my sister left some for me to eat in the morning on the dining table, it was partially eaten so I thought it was eaten by my sister and ate it.\n\nMy sister denied this and suspected that the new cat mightve ate it. We have 4 cats so we were not entirely sure if the unvaxxed cat ate it. Anyway I didn't think much of it since my friend told me rabies is usually spread through bite and not by eating.\n\nOn around 3rd of January I had slight headache, this is my first suspicion that I have rabies. In anxiety I got vaccinated on 5th of January 10 days after the possible exposure.\n\nOn 6th of January I was going back from home to college hostel where I fainted while standing in the metro. I didn't eat or sleep the morning before so maybe that's why.\n\n7th January I felt a bit numbness in my leg, though my leg was already operated before so it had numbness but this felt way more numb.\nIn class lecture I has extreme feeling of nausea and anxiety of rabies. From this point things started getting serious. \n\nThey took me to hospital but the doctor said I have anxiety and I am manifesting the symptoms. My muscles were twitching so much, and my body felt a little cold. I had no fever though.\n\nFrom 7th to 11th I had repeated visits to doctor and had some low vitamins(b,d) which they injected into me and they kept telling me it's anxiety and I don't actually have it.\n\nOn 12th I started feeling a tight sensation in my throat and felt like something was blocking inside, I immediately rushed to my hometown got hospitalized and the doctors did endoscopy in my throat and found hernia in my stomach and oesophagus due, and swelling in my throat. They suspect the hernia might be causing the acid to go up the food pipe and cause issue in the throat resulting in the swelling. Till now all doctors have denied the possibility of rabies by diverting it to some other diseases. \n\nRight now(17th january) I am feeling slight pain in my throat while dry swallowing or drinking water. I am extremely anxious and scared. Doctors keep telling me it's just coincidences causing these and I have googled way too much so I am starting to manifesting them but these feel way too real.\n\nAll this time I didnt have fever a single time by the way and after 13th my twitching reduced.\n\nI am in extreme despair and I don't know how to cope with it, the throat pain have amplified it even more.\n\nThe cat got vaccinated few days after my exposure and she is perfectly fine right now.",
        "date": "2025-01-17",
        "author": "nemoam7",
        "url": "https://www.reddit.com/r/india/comments/1i3iw46/i_think_i_have_rabies/",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iacofv",
        "title": "The uncle in the sweater registered a false complaint and police came for investigation and threatened me that he would do false case and put false section on me .",
        "description": "So I went to book my Tatkal tickets and I was the first one in the queue and then this guy shows up on 7th place and as he feared of not getting the tickets made a false complain that I was an agent and was getting unnecessary tickets. So when the police can I started recording and then the railway  police man threatened me of doing false case and section even tho I didn’t did anything wrong!! \nThis is the clip where he threatened me as I recorded the earlier moment too where this guy checked my details and clicked pics of my Adhar card and all .",
        "date": "2025-01-26",
        "author": "LetterheadQuirky6442",
        "url": "https://v.redd.it/4inghwehubfe1",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1hxwpf6",
        "title": "Extremely disappointing experience with Air India",
        "description": "My mum recently booked an international flight from India with Air India. She was checked in by the counter staff, boarded the flight, and was ready for takeoff. Everything seemed fine—UNTIL someone came and deboarded her from the plane because of excess baggage of 3 KG.\n\nAre you serious? Did your counter staff not notice this during check-in? If they had flagged the overweight baggage at the counter, my mum could have resolved the issue by either paying the fee or removing some items. Instead, she was humiliated, escorted off the plane, and not allowed to reboard.\n\nAdding insult to injury, Air India refused to issue a refund on the spot, instead asking us to apply through their website—where no such option exists. 🙃\n\nWho will compensate for the extra expenses now? The extended stay in India while we scramble for another flight, the additional travel to and from the airport. Who is accountable for this unnecessary hassle?\n\nThe Air India staff is totally unhelpful, offering no solutions and refusing to give any solution. This whole ordeal was not only distressing but also completely avoidable if their team had acted professionally at check-in.\n\nThis experience has made one thing abundantly clear: Air India’s cheaper tickets are not worth the mental distress. We only booked this flight because of a last-minute decision, but moving forward, we’ll never fly with Air India again. Their incompetence has cost us time, money, and peace of mind.\n\nDo better.\n\n#airindia",
        "date": "2025-01-10",
        "author": "pizzagalfromsf",
        "url": "https://www.reddit.com/r/india/comments/1hxwpf6/extremely_disappointing_experience_with_air_india/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1if14cr",
        "title": "Fraudulent Booking Issue with Pickyourtrail - BEWARE!!",
        "description": "I recently booked a trip through PickYourTrail, and it turned out to be an absolute nightmare. I paid approximately ₹90,000 for a 3-day stay at Dhiffushi Island, Maldives, expecting a decent experience. However, the reality was far from it. The location was extremely basic, far from luxurious, and we were accommodated at Araamu Holidays and Spa—a standard 3-star hotel with only three room categories:\n\nBasic Room → Deluxe Island View – Balcony\nDouble Occupancy Room → Superior Sea View – Balcony\nFamily Suite → Superior Island View – Balcony\nOur invoice (screenshot attached) clearly stated that we were booked for a Superior Island View (Family Suite). However, the room we were given was no better than a budget lodge. Upon investigating, I found that the actual price of the room wasn’t even ₹5,000 per night (screenshot attached). I also reached out to the hotel staff for their official tariff rates (screenshot attached), which confirmed the scam.\n\nWhen confronted, PickYourTrail falsely claimed that their pricing was completely different and accused the hotel of lying. The truth is, they cheated us outright. If you're considering booking with them after reading their Google reviews—DON’T! Most of the reviews you see here are fake and paid.\n\nSave yourself the hassle and book directly through Booking.com or MakeMyTrip. I have undeniable proof—emails, photos, and videos—to back my claims. This agency preys on unsuspecting travelers, scamming them out of their hard-earned money. Avoid them at all costs.",
        "date": "2025-02-01",
        "author": "Overthinkingkidukaan",
        "url": "https://www.reddit.com/gallery/1if14cr",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1htqipt",
        "title": "Disappointed by Dhruv Rathee’s ‘Reality of Men’s Issues’ Video on Atul Subhash – My Thoughts",
        "description": "I am a long-time viewer of Dhruv Rathee’s videos and have always appreciated the way he discusses social issues. However, his video titled \"Reality of Men’s Issues | Atul Subhash Case\" left me deeply disappointed. First of all, it took him nearly four weeks after Atul’s suicide to speak about it. This delayed response seemed like a reaction to pressure from his subscribers to address the case. He cleverly used Atul Subhash’s photo in the thumbnail and included his name in the video title, making it appear that the focus would be on Subhash’s story. However, the video barely scratched the surface of Subhash’s case. Instead of focusing on him, Dhruv used the case as a springboard to discuss broader issues like feminism, patriarchy, men’s emotional struggles, and social stigma in Indian society. While these topics are important, I feel that Dhruv should have focused more on Atul Subhash’s story.\n\nUnlike his previous videos, such as those on Anna Sebastian's death or the Kolkata Rape case, where Dhruv provided detailed explanations and even used AI-generated visuals to break down the incidents, this video lacked the same depth and thoroughness. He did not address the emotional and financial torture Atul Subhash endured, nor did he go into the specifics of Subhash’s suicide note and video, which detailed the abuse he faced from his wife, her family, and a corrupt judge. Key aspects, like the legal battles, extortion accusations, and the role of Nikita Singhania, Subhash’s estranged wife, were barely mentioned.\n\nAnother glaring omission was Dhruv’s failure to address sensitive topics such as the misuse of alimony laws, which was central to this case. I think he has avoided these issues because it might upset a certain segment of his audience. He used Atul Subhash's tragic story as clickbait to promote a broader narrative on feminism and patriarchy and its relation to Men's issues, without delving deeper into the actual case itself.",
        "date": "2025-01-04",
        "author": "SuitableMacaroon7808",
        "url": "https://www.reddit.com/r/india/comments/1htqipt/disappointed_by_dhruv_rathees_reality_of_mens/",
        "location": "India",
        "predicted_category": "Education Department"
    },
    {
        "complaintid": "1iqmb0t",
        "title": "PM Modi's 1st solo press conference in a nutshell",
        "description": "Credit: Sathish Acharya",
        "date": "2025-02-16",
        "author": "Traditional_Age_9365",
        "url": "https://i.redd.it/k59vwbbm5gje1.jpeg",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1ieae40",
        "title": "Refund issues with Amazon india.",
        "description": "I order headphones on 17 January 2025 and they were canceled by the delivery agent on 18th and when I called him, he informed me that the headphones got damaged during the transit . \nIt's been almost 13 days since amazon has not even initiated my refund despite connecting with the chat support executive they did not initiated it.\nWhen I connected with them again today(31 st Jan 2025) , she told me that it will get refunded in 5 business days , I have bought the headphone using my credit card ,if the refund does not gets processed before the 5th Feb I will be getting charged for late payments. \n",
        "date": "2025-01-31",
        "author": "Impressive-Usual4926",
        "url": "https://www.reddit.com/gallery/1ieae40",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1iz4ath",
        "title": "What's Tamil Nadu's problem with NEP and South's issue with UGC?",
        "description": "",
        "date": "2025-02-27",
        "author": "naveen_reloaded",
        "url": "https://www.youtube.com/watch?v=bJfumyqMwcE",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1j188w6",
        "title": "Rigorous enforcement of public anti-spitting ordinances is required",
        "description": "Public Spitting in India: A Serious Hygiene Concern\n\nPublic spitting is a widespread issue in India, contributing to unhygienic conditions …Roads, railway stations, and public spaces are often stained with gutkha and paan, making cities look unclean and unhealthy.\n\nIt makes streets dirty and increases cleaning costs.A cleaner India starts with individual actions.As a growing nation, we must maintain hygiene standards. GLOBAL image is Fkd up !!! \n\n\nInstead of just imposing fines, we also need awareness campaigns, public education, and accessible spitting bins to bring lasting change. It’s time to take responsibility and say NO to public spitting!\n\nWould love to hear your thoughts—how can we work together to make India spit-free? #CleanIndia #StopSpitting ",
        "date": "2025-03-01",
        "author": "Gullible_Pickle7987",
        "url": "https://www.reddit.com/gallery/1j188w6",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1hvm05d",
        "title": "Chennai MTC introduces smart travel card for cashless ticketing in buses, metro rail.The commuters can purchase tickets by swiping in the electronic ticketing machines used for issuing tickets in MTC buses. ",
        "description": "The card envisioned under the national common ticketing system could be used for travelling in buses and metro trains throughout the country.",
        "date": "2025-01-07",
        "author": "Ashwin_400",
        "url": "https://www.thehindu.com/news/cities/chennai/mtc-introduces-smart-travel-card-for-cashless-ticketing-in-buses-metro-rail/article69067142.ece",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1i62g36",
        "title": "Complaints about IRCTC vendors overcharging passengers are becoming increasingly widespread and concerning. This issue has the potential to escalate into a significant scandal. It is crucial for everyone to raise their voice against such malpractice. If you encounter overcharging, please call 139.",
        "description": " I'm attaching the price list please consider checking this before paying a single coin. \nAlways ask for bill. They will not provide you they will ask you to pay 120rd for a 80rs food thali some even charge 150. Please don't pay any extra money. And just file a complaint by just calling at 139. By doing so they will be imposed with a fine of 25000 and with other penalties. ",
        "date": "2025-01-20",
        "author": "souryya",
        "url": "https://www.reddit.com/gallery/1i62g36",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1i4yc3p",
        "title": "I potentially improved the lives of 2.03 Crore Indians with just an Email",
        "description": "I want to share with everyone something amazing that I just achieved by just emailing WBSEDCL while sitting at home and potentially being the catalyst to improving the lives of 2.03 Cr WBSEDCL users in West Bengal. \n\nI emailed WBSEDCL which is a govt owned company in WB which provides electricity to 96% of Bengal. I sent them an email (pic attached above) suggesting some improvement in their service and to my surprise in 5 months they took everything very positively and implemented most of my suggestions(Image Proof attached above)\n\nThe entire credit goes to WBSEDCL and their employees for bringing so many great upgrades to their system and improving their service. It maybe that these were already in their pipeline but an app getting an update after 4+ years after someone complained doesn't seem like a coincidence to me. I emailed them on August 2024 and 5 months is enough time to upgrade the app when most features already exist so I believe I was the catalyst for change.\n\nQ. Why is it such a big thing?\nA. Nothing in India gets fixed without complaints. If you complain/register a docket for power cut, I can guarantee you the power will be back in 15 mins. I have been doing the same and get back power within 15 mins. They are required to fix powercut ASAP if you complain as the complaints are monitored and alarms go off if they don't. If you don't complain then they will fix it at their leisure. Give it a try.\n\nQ. Whom did I write the email and whom did I send it?\nA. I generated the email using ChatGPT and then I searched everyone related WBSEDCL like the CC, Ministry of Power, CMO, Power Secretary, all the officers and peoples email mentioned on their website and on the internet, took me just 5 mins to find them and send this email\n\nEven if 1% of the 2 Crore WBSEDCL users use these services, it would benefit 2 lakh people. The 2.03 crore are just users with machine registered on their name, considering each family has 5 members, this helps improve services to potentially 10 Crore people in West Bengal.\n\nMoral of the story - The govt will work, the govt will listen to you if you speak up and get your voices heard to the right people. Emails are a superpower each and every citizen has. Use ChatGPT create an email and start complaining and improving services around you. 5 mins of my time improved services to 2 crore people. Imagine what we can achieve if everyone starts spending 5 mins emailing every weekend to improve roads, clean city, build parks etc.",
        "date": "2025-01-19",
        "author": "the-velvethunder",
        "url": "https://www.reddit.com/gallery/1i4yc3p",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1j2cbsc",
        "title": "Need Health Insurance for My Father (65) No Policy Covers Heart Issues Post Angioplasty.",
        "description": "Hey everyone,\n\nI’m looking for a health insurance policy for my father (65 years old) who had an angioplasty in 2015 and also has BP and diabetes. I contacted multiple insurance agents, and they all told me that no insurer covers heart-related issues after 7 years of angioplasty. The minimum waiting period is 7 months to 7 years, but after that, heart-related problems are completely excluded from all policies.\n\nI checked with:\n\nCare Heart – Does not cover heart issues. It only covers other diseases with 20% co-pay (we pay 20%, they cover 80%).\n\nStar Comprehensive – General policy that excludes heart issues but has 10% co-pay (we pay 10%, they cover 90%) for other illnesses.\n\nAditya Birla – Offers cashless hospitalization, but heart-related treatments are excluded.\n\n\nSo, no policy actually covers heart conditions. Even so-called cardiac-specific plans exclude pre-existing heart diseases.\n\nMy budget is ₹40K - ₹45K annually, but my priority is full heart coverage.\n\nDoes anyone know of a policy that actually covers heart problems?\n\nIf not, what should I do? Any suggestions for alternative ways to manage heart-related medical costs?\n",
        "date": "2025-03-03",
        "author": "ChickenRoll_",
        "url": "https://www.reddit.com/r/india/comments/1j2cbsc/need_health_insurance_for_my_father_65_no_policy/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1iswxr8",
        "title": "Efforts to serve complaint on Gautam Adani, Sagar Adani ongoing: SEC tells US court",
        "description": "",
        "date": "2025-02-19",
        "author": "bhodrolok",
        "url": "https://www.newindianexpress.com/business/2025/Feb/19/efforts-to-serve-complaint-on-gautam-adani-sagar-adani-ongoing-sec-tells-us-court-2",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1ifrqol",
        "title": "My Bank Account Was Frozen After Filing a Cyber Fraud Complaint, and ₹1000 Disappeared from my account while it was Debit frozen! What Should I Do?",
        "description": "I recently fell victim to a cyber fraud scam where I lost ₹1000. As advised, I immediately called **1930** (the cyber fraud helpline) to report the incident. My complaint was then forwarded to the **local police**, but instead of taking action, they kept giving me the runaround—telling me to \"call tomorrow\" every time I followed up.\n\nNow, my **bank account is frozen**, and I can’t make any **UPI transactions** or withdrawals. However, the most confusing part is that before my account was frozen, I had **₹1000.49** in my account. But now, it only shows **₹0.49**!\n\nThis is where things get really **suspicious**. The police were aware that I had been scammed for exactly ₹1000, and after my complaint, an additional ₹1000 has **vanished from my account**. Did the police or the bank take the money? Was it deducted due to the fraud complaint? I have no idea what's happening.\n\nI am going to my **bank today** to find out what’s going on, but I feel completely lost and frustrated. If anyone has gone through something similar, please advise me on:\n\n1. **Why would money disappear from a frozen account?**\n2. **How can I get my account unfrozen quickly?**\n3. **What legal steps can I take if the bank and police don’t help?**\n\nThis whole experience makes me question why they even promote 1930 if there’s no real action taken. Instead this is giving me more stress and pressure. I am 20M and my parents are becoming more angry becasue of this. Any help or insights would be appreciated! ",
        "date": "2025-02-02",
        "author": "Tough_Comfortable821",
        "url": "https://www.reddit.com/r/india/comments/1ifrqol/my_bank_account_was_frozen_after_filing_a_cyber/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1itxde1",
        "title": "I&B ministry issues advisory to OTT platforms over obscene content",
        "description": "",
        "date": "2025-02-20",
        "author": "bhodrolok",
        "url": "https://www.livemint.com/industry/media/social-media-ott-platforms-obscene-content-i-b-ministry-advisory-ranveer-allahabadia-it-rules-11740046072364.html",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1it75sv",
        "title": "Hindi imposition isn't just a South Indian issue; it's very much a North Indian one too.",
        "description": "",
        "date": "2025-02-19",
        "author": "Dramatic_Respond7323",
        "url": "https://v.redd.it/i4sz7gzes2ke1",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1iuy0yq",
        "title": "Research on issues faced by visually impaired citizens using Indian currency.",
        "description": "Hi! I am a design student and I'm researching the issues faced by the visually impaired (all impairments on the spectrum for now) in using the Indian currency notes for my design thinking skills course and later I will redesign the notes accordingly. \n\nI would greatly appreciate if y’all could provide inputs regarding the user journey of these people during transactions, the issues they have with the notes (tactile features, colours, size, differentiating between the notes, time taken on an average to complete transaction, if help required from an abled person or not, if they personally face some unique struggle, if they ever faced some monetary issues because of their disability, etc). \n\nWhether you or someone you know is visually impaired, please share such details it would greatly benefit in the research process!!! You can write in the comments or even DM me if you think i might ask some more questions regarding this.\n\nAnother input that would be helpful is the new age technology of UPI. what are visually impaired users’ feedback  regarding online transactions? Do they still face issues, if yes then please state issues and also let me know if you like it better than physical notes or not and reasons for both as well. \n\nAnd what kind of features you would like to be included in the notes and why? Feel free to give every kind of suggestion!\n\nThank you so much!!!! Your inputs would genuinely help a lot and maybe it will make the change this community needs. \n\n",
        "date": "2025-02-21",
        "author": "paranormal_beast",
        "url": "https://www.reddit.com/r/india/comments/1iuy0yq/research_on_issues_faced_by_visually_impaired/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1irbiow",
        "title": "The 74th Amendment is the key to our civic issues",
        "description": "Indian cities are weak. They don’t have any real power, money, and accountability. How can you expect them to solve our sanitation and infrastructure problems?\n\n3 fundamental shifts must happen:\n\n**Shift some power from States to Cities by  rewriting the 74th Amendment**\n\n- State governments must transfer key revenue generation, planning and zoning, infrastructure , waste management powers to municipalities.\n\n- Hire CEOs to oversee cities not IAS officers as city leaders. They should be answerable to local elected leaders. Masters in Public Administration must be popularised in Indian schools.  They should urgently begin an urban planning standardisation programme across India.\n\n\n**Give Cities Direct Financial Control**\n\n- Cities must collect and keep local taxes (property tax, business levies, tolls).\n\n- End state control over urban budgets—funds should go directly to municipalities.\n\n- Encourage private sector investment in sanitation, waste management, and public services. This is going to be very important.\n\n**Build a Culture of Civic Engagement**\n\n- Make urban governance citizen-driven, not top-down.\n\n- Mandatory public consultations before major city projects.\n\n- University, schools, and local businesses must have opportunities to solve problems for local governance.\n",
        "date": "2025-02-17",
        "author": "Ramen-hypothesis",
        "url": "https://www.reddit.com/r/india/comments/1irbiow/the_74th_amendment_is_the_key_to_our_civic_issues/",
        "location": "India",
        "predicted_category": "Municipal Corporation"
    },
    {
        "complaintid": "1iizzxl",
        "title": "Karnataka Bitcoin scam: SIT issues new notice to Youth Congress chief Mohammed Haris",
        "description": "",
        "date": "2025-02-06",
        "author": "Cybertronian1512",
        "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bitcoin-scam-sit-issues-new-notice-to-youth-congress-chief-mohammed-haris-9820796/",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1hrrful",
        "title": "[India] Background Verification (BGV) Issue with New Employer Using Checkr – Need Advice",
        "description": "Hi everyone,\n\nI’m in a tough spot with my job transition and could really use some advice.\n\nHere’s the context:\n\t•\tA few months ago, my father, while dealing with depression, filed an FIR against me. The very next day, he realized his mistake and requested the police to withdraw it.\n\t•\tIn September 2024, during a Background Verification (BGV) conducted by a potential employer, it was found that the case was still active. I immediately consulted my lawyer, and after a lot of effort, the case was disposed of. I’ve confirmed this online, and the status is clear.\n\t•\tThe new employer used Checkr for the BGV process.\n\nThe issue:\nRecently, HR from the new company informed me that I didn’t clear my BGV. However, they refused to provide specific details, citing confidentiality, leaving me in the dark about the flagged issue.\n\nThe complication:\nI’ve already begun my notice period at my current company, with only 20 days left. I have no history of BGV issues, having successfully cleared stricter checks during my employment with EY, Disney, and for visa applications.\n\nWhat I need help with:\n\t1.\tHow can I approach the new employer or Checkr to get clarity on the flagged issue?\n\t2.\tShould I consider withdrawing my resignation from the current company?\n\t3.\tHas anyone experienced issues with Checkr in India, and how did you resolve them?\n\nI’d really appreciate any advice or shared experiences to help me navigate this situation.\n\nThanks in advance for your support!",
        "date": "2025-01-02",
        "author": "FrostyConstant3797",
        "url": "https://www.reddit.com/r/india/comments/1hrrful/india_background_verification_bgv_issue_with_new/",
        "location": "India",
        "predicted_category": "Public Safety & Police"
    },
    {
        "complaintid": "1ic7e1i",
        "title": "Boy asks mother why family is sending sister to US if India is the best: MTV’s ad wins internet on Republic Day.",
        "description": "",
        "date": "2025-01-28",
        "author": "kartgonewild",
        "url": "https://indianexpress.com/article/trending/trending-in-india/mtv-republic-day-ad-on-important-questions-viral-9801449/",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1ijob33",
        "title": "EPFO is a joke on common man which is designed to Frustrate, Not Facilitate. A Rant About Withdrawing My Own Money",
        "description": "\\*\\*\\*\\* 'LONG POST OR RANT(MOSTLY RANT)' ALERT \\*\\*\\*\\*\n\n  \nI tried withdrawing funds from EPFO for personal reasons, and let me tell you, it’s an absolute circus to get access to your own money.\n\nIf you’ve never had the \"pleasure\" of using the EPFO site, go ahead and try it—you’ll quickly realize how monumentally terrible the system is when you’re attempting to get your hard-earned money from a government-managed institution.\n\nOn the contrary, when it comes to the government wanting to squeeze money out of the common man/woman for income tax, GST, tolls, and every other way they can milk you dry. Oh, they work like a charm. Funny how there’s top-notch tech when it’s time to extract money from us, but when we need it back, you go through a system built from the stone age tech? \n\nAnyway, back to my EPFO nightmare, where the government seems hell-bent on making it as difficult as possible for me to access my own money. \n\nLet's start with logging into the EPFO site. What a shitshow of a site. Let's begin with the homepage:[ https://www.epfindia.gov.in/site\\_en/index.php](https://www.epfindia.gov.in/site_en/index.php). It is so hard to find a way to log in to your account. Guess what? You have to click through a bunch of links to see which one takes you to the login page.\n\nI’ll save you guys the trouble, so click on the 'Online claims Member Account Transfer' button on the homepage for that. Why can't it simply say 'Log in'?\n\nNext, try logging in with your credentials in one attempt. You’ll probably be met with failure because, guess what, the site is broken more often than it’s functional. \n\nIf you’re lucky enough to get past the password page, great! But wait—there’s more! You’ll be sent to another screen where you’ll need to enter a mobile OTP and CAPTCHA again. Meanwhile, the government portals to collect money from you? Smooth as silk, no CAPTCHA, no OTP nonsense. It works like it's built by world-class developers.\n\nSo, after a thousand attempts, you finally manage to log in. Now, you want to check your PF balance? Too bad. You have to open the UAN passbook site. What? The EPFO site you just struggled to log into doesn’t even store your PF balance?\n\nokay, fine. Lets try to login to UAN Passbook site. YOU CAN'T.\n\nOOPS, incorrect UAN.\n\nLet me try again.\n\nOOPS. INCORRECT PASSWORD.\n\nokay fine, my bad. let me try again.\n\nOOPS, INCORRECT CAPTCHA.\n\nURGGHHH, Why am I so bad at typing? Let's try again.\n\nOOPS, INCORRECT UAN AND PASSWORD. BYE BYE. COME BACK LATER.\n\nIn desperation, you reset your password because that’s what’s required for the UAN passbook site, which, let me remind you, is a *completely separate* site with a *separate login*. \n\nAfter resetting, you’re told you can only use the new password on the UAN Passbook site after 6 hours. SIX HOURS. What kind of low-budget operation is this? Are they manually syncing passwords between sites?\n\nNow, let’s go back to the EPFO member site. Try to withdraw your money? Fill out the claim form, only to be rejected for some unknown reason. They won’t tell you why, of course. Why bother explaining anything when they’ve got your money? Maybe just try a different claim amount or reason. It’s not like it’s *your* money.\n\nOkay, let’s say you’re the luckiest person in the universe, and your claim is actually approved. Wait—\"approved\"? It’s *my* money. In any other system, this would just be an automatic process, not some arbitrary decision made by a faceless bureaucrat. But no, in this twisted game, the system needs to \"approve\" it.\n\nAlright, so your claim is approved. But don't get too excited just yet. What if they credit the wrong amount?\n\nAnd, of course, the wrong amount will always be *less* than what you requested. I got 40% less than what I was entitled to.\n\nSo, what do you do now? Try to get in touch with EPFO, of course. Here's how you can contact them:\n\n* Email: Sent one. I’m not even sure anyone reads these emails, given that they’re probably buried under thousands of others.\n* Toll-free number: Doesn’t work. Ever. I’ve been trying for days, and the call just disconnects.\n* You can try raising a grievance. But guess what? The grievance form doesn’t accept your 17-digit claim ID. Try it yourself; you won’t be able to submit it.\n\nSo what’s next? You go to the EPFO office and beg for your own money.  They’ll be rude, dismissive, and treat you like you’re asking for charity. Meanwhile, you’re just trying to get your own damn money.\n\nThe whole system is set up to make sure you never see a dime unless you jump through a million hoops.\n\nIt’s not as easy as paying income tax, reloading your FASTag wallet or paying gst. No, those things are efficient. Getting your own money? That’s a different story.\n\nMy struggle to fix this issue has just begun, all of that I have shared is just the beginning. \n\nMaybe this issue will be fixed one day, maybe not. My bet is on not. \n\nMaybe all of this will be fixed someday, maybe not. Again, my bet is on not. \n\nRant over! \n\nIt’s 11.30 AM already so let's go back to our meetings and daily hustle so we can help govt turn the billionaires into Zillionaires while we continue to live like insects. \n\nokay, rant over for real.   \n",
        "date": "2025-02-07",
        "author": "DragonfruitThin1574",
        "url": "https://www.reddit.com/r/india/comments/1ijob33/epfo_is_a_joke_on_common_man_which_is_designed_to/",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1hxzs8v",
        "title": "Is it time for an Indian Banksy? | The list of issues in need of public scrutiny is growing by the day but Indian street art continues to play it safe",
        "description": "",
        "date": "2025-01-10",
        "author": "--5-",
        "url": "https://www.thehindu.com/society/indian-street-art-graffiti-banksy-public-affairs-commentary-politics-social-issues-girl-with-balloon/article69071332.ece",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1hy0303",
        "title": "How to file consumer complaint against order2india portal and shadowfax delivery",
        "description": "Hi everyone\n\nI had never done consumer complaint before and this is the first time I genuinely feel the need to escalate the issue further-\n\nI placed order for an expensive phone cover and after 3 weeks i received delivery message from shadowfax t where the status updated to \"customer requested change of date\". This happened continuously for the whole week- And I never received any call from them\n\nSo far i thought it's just a delivery person finding it difficult to deliver by the end of his duty time so i didn't worry much. But when I tried to contact the delivery number given, that's when it started getting messy- there was no working number and the delivery person number they shared was a wrong number. \n\nI tried to reach https://order2india.com/ support mail id first since I could not get through the delivery team. But here too i received automated response and there's no working phone number here as well \n\nI feel that many like me would unknowingly place order with this portal and suffer without a recourse\n\nI want to escalate this, since there could be many who are facing similar situation with these two teams\n\nHas anyone experienced similar situation with online portals, can you please help me with this? \n\n",
        "date": "2025-01-10",
        "author": "links253",
        "url": "https://www.reddit.com/r/india/comments/1hy0303/how_to_file_consumer_complaint_against/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1ibxn1w",
        "title": "Unpopular opinion: China is leaps and bounds ahead of India. We must be careful!",
        "description": "China made DeepSeek AI with less than 5% of ChatGPT expenditure and utilizing less than 2000 GPUs as against 10,000 GPUs being used by OpenAI models. \n\nThe cost is less than 50 cents for 1 million tokens which is not even 1% of that one would pay for ChatGPT. While China is doing all that, we Indians are shitting on our rivers in the name of religion and taxing popcorns. \n\nWhile the world can hate on China as much as they want, China has the balls to challenge giants like Sony and Samsung. It has made technology so cheap that even the poorest of the population in India is not using a smartphone. \n\nPlease don’t get me wrong, my intend for this post is for the Indians to wake up and realize that one of our neighbours is certainly a force to be reckoned with. We need to encourage technology and entrepreneurship to grow at even half the pace of China. Simultaneously the investment in our educational infrastructure has to increase manifolds to create a generation that prioritises growth over petty social issues.  \n\nI hope we as young Indians can demand from our government the growth that is much due. \n\nJai Hind! ",
        "date": "2025-01-28",
        "author": "Aarvy271",
        "url": "https://www.reddit.com/r/india/comments/1ibxn1w/unpopular_opinion_china_is_leaps_and_bounds_ahead/",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1hux32l",
        "title": "Weather update for coming week: IMD issues dense fog warning for north India, Himachal to see rainfall ",
        "description": "",
        "date": "2025-01-06",
        "author": "VCardBGone",
        "url": "https://www.businesstoday.in/india/story/weather-update-for-coming-week-imd-issues-dense-fog-warning-for-north-india-himachal-to-see-rainfall-459638-2025-01-05",
        "location": "India",
        "predicted_category": "Roads & Transport Department"
    },
    {
        "complaintid": "1ibtnu6",
        "title": "Infosys co-founder Kris Gopalakrishnan among 18 booked under SC/ST Atrocities Act",
        "description": "Infosys co-founder Kris Gopalakrishnan among 18 booked under SC/ST Atrocities Act\nThe complainant who belongs to the tribal Bovi community, was a faculty member at the Centre for Sustainable Technology at the Indian Institute of Science\nUpdated - January 28, 2025 09:39 am IST - Bengaluru\n\n\nSadashivanagar police have registered a case against Infosys co-founder Senapathy Kris Gopalakrishnan and 17 members of Indian Institute of Science under the SC/ST Act based on a private complaint filed by a faculty member accusing them of dismissing him from service through a fake honey trap case and subjecting him to casteist abuse.\n\nThe complainant, Professor D. Sanna Durgappa, formerly with Centre for Sustainable Technologies, had approached the 71st city civil and session court. The court directed the jurisdictional police to register a case and investigate the matter. The case was registered on January 27.\n\nNot every ‘insult’ against SC/ST persons can be considered as offence under SC/ST protection law, says Supreme Court\n\nThe complainant, Durgappa, who belongs to the tribal Bovi community, was a faculty member at the Centre for Sustainable Technology at the Indian Institute of Science (IISc).\n\n\nAccording to the complaint, the accused used fake honey trap case to dismiss him from service in 2014. He further alleged that he was subjected to casteist abuse and threats.\n\nAll insults not offence under SC/ST Act: Supreme Court\n\nEven the sexual harassment committee formed by IISC violated the SC ruling and did not have a single member from an NGO.\n\nEven though IISc agreed to take him back, Prof. Durgappa alleged that he has not been taken back and that he could not get a job anywhere in India, and that he was defamed. He accused the Union Education Ministry of giving wrong replies.\n\n\nProf. Durgappa further alleged in his complaint that even though 30 sexual harassment complaints were registered, no action has been taken..\n\nHe accused the IISc of misusing ₹2,500 crore of funds and various directors had brought stay orders from courts over 15 times to scuttle all efforts to bring the alleged irregularities to light.\n\nThe complainant claims to be getting threats from the accused.\n\n\nThe accused in this case include Govindan Rangarajan, Sridhar Warrier, Sandya Vishwswaraih, Hari K V S, Dasappa, Balaram P, Hemalata Mhishi, Chattopadyaya K, Pradeep D Sawkar, and Manoharan.\n\nThere was no response from the IISc faculty or from Kris Gopalakrishnan, who serves as a member of the IISc Board of Trustees.",
        "date": "2025-01-28",
        "author": "pranagrapher",
        "url": "https://www.thehindu.com/news/national/karnataka/infosys-co-founder-kris-gopalakrishnan-among-18-booked-under-scst-atrocities-act/article69149225.ece",
        "location": "India",
        "predicted_category": "Electricity Department"
    },
    {
        "complaintid": "1i0xjaq",
        "title": "Myntra sent me Crocs straight from the cow shed",
        "description": "I ordered a pair of Crocs from Myntra, and this is what I received. Either someone switched them during packaging, or a scumbag customer returned these, and no one bothered to check before reselling.\n\nWhoever did this didn’t even have the decency to clean them, there was literally cow dung and mud on the clogs. They also ripped the original packaging like savages.\n\nThankfully, I had recorded an unboxing video, so I was able to get a refund, but it still took three days. The local Ekart team initially rejected the return, and I had to escalate the issue.\n\nPro tip: Always make an unboxing video when shopping online.",
        "date": "2025-01-14",
        "author": "EarphoneJunkie",
        "url": "https://www.reddit.com/gallery/1i0xjaq",
        "location": "India",
        "predicted_category": "Water & Sanitation Department"
    },
    {
        "complaintid": "1hrqx0f",
        "title": "Corrupt GST Officer",
        "description": "So I’m trying to get a GST registration for my wife who’s a freelancer exporting IT services abroad. The officer rejected the application because “he could not verify the address. He called 7 times but nobody responded”. I checked the call details and saw one number called once not seven. I talked to my CA and he confirmed that this is the tax official and he’s known for harassing businesses in the area until they pay up the bribe. And I’ll probably have to shell out too if I want this registration done. I’ve been trying to get the application approved for the last 3 months but they’re rejecting it because  of one reason or another. \n\nI’m extremely disappointed the way how our country is being run by these corrupt officials. I really don’t care about the amount of money for a bribe but it just hurts to know that I have to pay bribe to some official in order to just pay my taxes and stay complaint.\n\nI’m just so angry right now and I’m not sure how to handle this situation except giving in and be a part of this corruption.",
        "date": "2025-01-02",
        "author": "Naya_Naya_Crorepati",
        "url": "https://www.reddit.com/r/india/comments/1hrqx0f/corrupt_gst_officer/",
        "location": "India",
        "predicted_category": "Electricity Department"
    }
]