[
    {
        "title": "Mumbai's Road Construction Causes Major Disruptions",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint1.html",
        "details": "THE HINDU BUREAU\nHYDERABAD\nSource: Read Full Article\nMumbai's extensive $700 million project to monsoon-proof its roads has led to widespread construction, causing significant inconvenience. Residents face daily traffic congestion and increased pollution levels due to the ongoing works."
    },
    {
        "title": "Delhi's Toxic Smog Raises Health Alarms",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint2.html",
        "details": "Source: Read Full Article\nNew Delhi residents are enduring unprecedented levels of toxic smog, with the Air Quality Index (AQI) skyrocketing over 1700. This severe pollution has led to school closures and restricted traffic, prompting discussions about relocating the capital due to health concerns.."
    },
    {
        "title": "Ola Electric Faces Customer Service Backlash",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint3.html",
        "details": "India's consumer rights agency issued a warning to Ola Electric after receiving over 10,000 complaints regarding delayed and unsatisfactory services, as well as inaccurate invoices. The company's market share has declined by approximately 40% due to customer dissatisfaction."
    },
    {
        "title": "Tragic Incident Highlights Hospital Security Flaws",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint4.html",
        "details": "The rape and murder of a 31-year-old doctor in a Kolkata public hospital have exposed severe deficiencies in hospital security and infrastructure. The incident has sparked nationwide protests and highlighted the inhumane working conditions for doctors."
    },
    {
        "title": "Delhi's Anti-Pollution Measures Prove Ineffective",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint5.html",
        "details": "Public Safety & Police Despite initiatives like smog towers and anti-smog guns, Delhi's air quality remains hazardous. Experts criticize the government's superficial approach and call for more robust, region-wide policies to combat pollution effectively.\nEnvironmentalists argue that while these measures may provide temporary relief, they do not address the root causes of pollution. The city continues to suffer from high levels of particulate matter, leading to severe health issues among residents.\nExperts recommend a comprehensive strategy that includes stricter emission controls, promotion of public transportation, and increased green cover to tackle the pollution crisis effectively.\nWhat are your thoughts on Delhi's pollution control measures? Share your views and suggest solutions for a cleaner, healthier city."
    },
    {
        "title": "Delhi's Anti-Pollution Measures Prove Ineffective",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint6.html",
        "details": "Public Safety & Police Despite initiatives like smog towers and anti-smog guns, Delhi's air quality remains hazardous. Experts criticize the government's superficial approach and call for more robust, region-wide policies to combat pollution effectively.\nEnvironmentalists argue that while these measures may provide temporary relief, they do not address the root causes of pollution. The city continues to suffer from high levels of particulate matter, leading to severe health issues among residents.\nExperts recommend a comprehensive strategy that includes stricter emission controls, promotion of public transportation, and increased green cover to tackle the pollution crisis effectively.\nWhat are your thoughts on Delhi's pollution control measures? Share your views and suggest solutions for a cleaner, healthier city."
    },
    {
        "title": "Overflowing Manholes Pose Health Risks in Haryana",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint7.html",
        "details": "Water & Sanitation Department\nResidents in Haryana are facing health hazards due to blocked sewerage systems and overflowing manholes. Complaints have been lodged regarding the inefficiency in addressing these issues promptly.\nThe overflowing manholes are causing severe inconvenience and posing serious health risks, especially during the rainy season. The stagnant water is a breeding ground for mosquitoes, leading to an increase in vector-borne diseases.\nAuthorities are urged to take immediate action to resolve these issues and ensure proper maintenance of the sewerage systems to prevent such occurrences in the future.\nHave you experienced similar issues in your area? Share your views and demand action for better sanitation services."
    },
    {
        "title": "Inadequate Waste Management in Vadodara",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint8.html",
        "details": "Municipal Corporation\nVadodara is grappling with challenges in municipal solid waste management, leading to environmental and aesthetic concerns. The city's infrastructure struggles to keep up with the increasing waste generation.\nResidents have reported overflowing garbage bins, irregular waste collection, and improper disposal methods, contributing to pollution and health hazards.\nAuthorities are urged to implement efficient waste management practices, increase the frequency of waste collection, and promote recycling to address these issues effectively.\nWhat are your thoughts on the waste management situation in Vadodara? Share your views and suggest solutions for a cleaner city."
    },
    {
        "title": "Complex Tax Filing Procedures in Gujarat",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint9.html",
        "details": "Taxation & Finance Department\nResidents in Gujarat have raised concerns about the complex and confusing tax filing procedures, leading to delays and errors in property tax assessments.\nThe current system is criticized for its lack of clarity and user-friendliness, causing frustration among taxpayers.\nAuthorities are urged to simplify the tax filing process, provide clear guidelines, and offer support to ensure accurate and timely tax submissions.\nHave you faced difficulties with tax filing in Gujarat? Share your experiences and suggest improvements for a more efficient system."
    },
    {
        "title": "Poor Water Quality in Prayagraj",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint10.html",
        "details": "Water & Sanitation Department\nResidents of Prayagraj have reported concerns over water contamination and quality issues, affecting daily life and health.\nThe contaminated water supply has led to an increase in waterborne diseases, causing significant health risks for the community.\nAuthorities are urged to take immediate action to improve water quality, ensure regular testing, and provide safe drinking water to residents.\nHave you experienced water quality issues in Prayagraj? Share your views and demand action for better water services."
    },
    {
        "title": "Illegal Immigrants to India: Stuck in Limbo, Waiting for Life to Happen",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint11.html",
        "details": "Date: March 2, 2025\nSource: Read Full Article\nThousands of individuals classified as illegal immigrants are stuck in uncertain situations, awaiting deportation to India. Many of these people are caught between bureaucratic delays, legal battles, and a lack of clear policies, leaving them stranded in foreign detention centers or refugee camps.\nWhile diplomatic efforts continue, affected individuals are facing severe humanitarian challenges, including inadequate living conditions, limited access to healthcare, and mental distress due to the prolonged wait. Families remain separated, and legal rights remain a grey area for those awaiting repatriation.\nExperts argue that a structured policy is needed to ensure humane repatriation while safeguarding national security interests. International agencies have also raised concerns about the treatment of these individuals, urging governments to prioritize human rights and fair legal processes.\nWhat are your thoughts on the current deportation policies? Should there be a more structured and humane approach? Share your views and join the discussion."
    },
    {
        "title": "Pune Bus Rape Case: Accused Dattatray Ramdas Gade Sent to 12-Day Police Custody",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint12.html",
        "details": "Date: March 2, 2025\nSource: Read Full Article\nThe Pune police have taken Dattatray Ramdas Gade into 12-day custody following his arrest in connection with the shocking rape case that took place inside a bus. The case has sparked outrage across the country, with demands for swift justice and stricter laws to prevent such crimes.\nAuthorities are investigating the case thoroughly, collecting forensic evidence and statements from witnesses. Public protests have erupted, urging law enforcement to take strict action against the accused and ensure that justice is delivered.\nThe incident has once again highlighted the urgent need for improved security measures in public transport and stronger legal frameworks to protect women from such heinous crimes.\nWhat are your views on the increasing crime against women in public places? Should stricter measures be enforced to ensure safety? Share your thoughts and support the movement for justice."
    },
    {
        "title": "Zerodha Founder Nithin Kamath Reacts to Sensex Fall of 1400 Points",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint13.html",
        "details": "Date: March 2, 2025\nSource: Read Full Article\nAs the Sensex tumbled by 1400 points, Zerodha founder Nithin Kamath shared his insights on the market fluctuations. Kamath stated that while he has \"no idea where the markets will go from here,\" he emphasized the importance of maintaining discipline and a long-term perspective in investing.\nThe significant drop in the stock market has left many investors uncertain, but Kamath advised them to stay patient and not make hasty decisions based on short-term movements. He highlighted the importance of diversification and systematic investing to navigate market volatility.\nThis latest downturn raises concerns about the broader economic outlook and investor sentiment in the coming weeks. Many experts believe that global economic factors, interest rate policies, and geopolitical uncertainties are playing a key role in the ongoing market instability.\nWhat are your thoughts on the current market situation? Do you think the Sensex will recover soon, or is this a sign of a bigger downturn? Share your opinions and stay informed!"
    },
    {
        "title": "Empowering Kerala's Digital Future",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint14.html",
        "details": "Date: March 2, 2025\nSource: Read Full Article\nKerala is making significant strides towards a digitally empowered future, driven by a strong push for technological innovation, digital literacy, and smart infrastructure. The state's commitment to digital transformation has led to initiatives that aim to enhance connectivity, education, and governance through technology.\nGovernment-backed programs focus on expanding high-speed internet access, promoting digital entrepreneurship, and integrating smart solutions across public services. The Kerala government has also prioritized cybersecurity measures to ensure safe and efficient digital transactions.\nWith an emphasis on skill development, institutions are collaborating to upskill the workforce, making Kerala a hub for tech-driven growth. The state's digital roadmap is expected to create new opportunities for businesses and improve the overall quality of life for citizens.\nWhat do you think about Kerala’s digital advancements? Share your thoughts on how digital transformation can shape the future."
    },
    {
        "title": "Delhi’s Healthcare: 10 Glaring Shortcomings Identified by CAG",
        "date": "Date not found",
        "link": "https://idyllic-cajeta-deb5e8.netlify.app/complaint15.html",
        "details": "Date: March 2, 2025\nSource: Read Full Article\nThe Comptroller and Auditor General (CAG) of India has identified 10 major shortcomings in Delhi’s healthcare system, highlighting serious gaps in infrastructure, medical resources, and patient care. The report exposes inefficiencies in hospital management, inadequate staffing, and lack of essential medical equipment.\nKey issues raised include long waiting times for critical treatments, overcrowding in government hospitals, and poor maintenance of healthcare facilities. The report also points out mismanagement of funds and delays in implementing healthcare schemes.\nDespite Delhi's significant healthcare budget, the findings indicate that many residents struggle to access quality medical services. The CAG has urged immediate corrective measures to enhance medical infrastructure and streamline healthcare delivery.\nWhat are your thoughts on Delhi’s healthcare system? Should authorities take urgent action to address these issues? Share your views."
    }
]