[
    {
        "complaint_number": 1,
        "summary": "It's not the first time you've heard of the term. It's the second time it's been used in this way. It was used in the 1970s and 1980s to refer to the use of the word \"novelty\" in the media.",
        "date": "2025-01-13",
        "location": "India",
        "keywords": [
            "consumer complaints",
            "consumer laws",
            "criminal blinkit",
            "blinkit thinks",
            "complaints resolved"
        ]
    },
    {
        "complaint_number": 2,
        "summary": "Award-winning author and TV personality Tom Charity has written a book about his life. The book is called \"Tom Charity: A True Story of a True Love Story\" The book will be published by Simon & Schuster, which will also publish the book \"Tom Cruise: A Real Life Story\" in paperback.",
        "date": "2025-01-25",
        "location": "India",
        "keywords": [
            "expressway cleaned",
            "km expressway",
            "expressway",
            "cpgrams portal",
            "cleaned using"
        ]
    },
    {
        "complaint_number": 3,
        "summary": "Award-winning author of \"The Godfather of Soul\" writes a book about his experiences. The book, published by Simon & Schuster, is called \"The godfather of soul\" The book also includes a guide to the English language and a guide for English-speaking people.",
        "date": "2025-02-19",
        "location": "India",
        "keywords": [
            "works nhai",
            "unpaved road",
            "nhai",
            "nhai correct",
            "bengaluru"
        ]
    },
    {
        "complaint_number": 4,
        "summary": "It's been a while since I've posted anything on my blog. Here's the lowdown on how to get your hands on some of my favorite books. I'm also a big fan of the TV show \"American Horror Story: Coven,\" which airs on the CW network.",
        "date": "2025-01-04",
        "location": "India",
        "keywords": [
            "93mobiles scam",
            "93mobiles",
            "scam pls",
            "scam",
            "don purchase"
        ]
    },
    {
        "complaint_number": 5,
        "summary": "It is not unusual to find yourself in a situation where you have to pay for your water bill through the back of your hand. It is a common practice in the U.S. to pay your water bills through the front door. This is not uncommon.",
        "date": "2025-02-23",
        "location": "India",
        "keywords": [
            "extended warranty",
            "buy laptop",
            "warranty buy",
            "warranty",
            "laptop isn"
        ]
    },
    {
        "complaint_number": 6,
        "summary": "It's not about the money, it's about the people. It's about how we treat each other, and how we get along. It is about how to get along with each other. And so it goes with the flow of things.",
        "date": "2025-02-13",
        "location": "India",
        "keywords": [
            "indian consumers",
            "toothless regulator",
            "trai toothless",
            "failing indian",
            "toothless"
        ]
    },
    {
        "complaint_number": 7,
        "summary": "The University of California, San Diego has banned students from attending classes. The ban is in response to a student protest against the university's decision to ban classes in the wake of a student's death. The university says the ban is a result of the student protest movement.",
        "date": "2025-02-18",
        "location": "India",
        "keywords": [
            "kiit university",
            "nepali students",
            "university hypocrisy",
            "evicting nepali",
            "nepal embassy"
        ]
    },
    {
        "complaint_number": 8,
        "summary": "A look at some of the things you need to know to be a successful business owner. A look at the different types of business you can run in the U.S. and around the world. A peek into the life of a business owner in the United States.",
        "date": "2025-01-13",
        "location": "India",
        "keywords": [
            "questions parents",
            "parents decision",
            "bjp cm",
            "decision kids",
            "candidate questions"
        ]
    },
    {
        "complaint_number": 9,
        "summary": "The National Suicide Prevention Lifeline can be reached at 1-800-273-8255. For confidential support call the Samaritans on 08457 90 90 90 or visit a local Samaritans branch, see www.samaritans.org for details.",
        "date": "2025-01-31",
        "location": "India",
        "keywords": [
            "leaves india",
            "despite passport",
            "passport court",
            "man leaves",
            "leave issues"
        ]
    },
    {
        "complaint_number": 10,
        "summary": "The author of the book, \"The Power of One,\" says the book is about the power of one man to change the world. The author is also the author of \"The Godfather,\" a book about the Bible's influence on the culture of the U.S.",
        "date": "2025-01-16",
        "location": "India",
        "keywords": [
            "kumbh mela",
            "mela allergy",
            "mela",
            "leaves kumbh",
            "kumbh"
        ]
    },
    {
        "complaint_number": 11,
        "summary": "The U.S. Air Force is planning a major overhaul of its air traffic control system. The Air Force wants to reduce the number of air traffic controllers in the country by 20 per cent. The move is expected to reduce air traffic in the region by 50 per cent by 2020.",
        "date": "2025-02-09",
        "location": "India",
        "keywords": [
            "india aqi",
            "index aqi",
            "aqi relatively",
            "aqi chart",
            "aqi"
        ]
    },
    {
        "complaint_number": 12,
        "summary": "The author is the author of a book on the history of the U.S. military. The book is called The Godfather of the American Soldier. The author also wrote a book about the American military called The Man Who Captured The Flag. The man who captured the flag was killed in Afghanistan.",
        "date": "2025-02-22",
        "location": "India",
        "keywords": [
            "man acquitted",
            "acquitted court",
            "demolished rape",
            "acquitted",
            "complaint muslim"
        ]
    },
    {
        "complaint_number": 13,
        "summary": "The owner of the property was not immediately available for comment. The property is in the process of being sold to a private buyer. The owner was not available for comments on the matter. The incident occurred in the early hours of the morning on Monday.",
        "date": "2025-02-26",
        "location": "India",
        "keywords": [
            "shop razed",
            "razed complaint",
            "boy parents",
            "held shop",
            "razed"
        ]
    },
    {
        "complaint_number": 14,
        "summary": "It's not about the sex, it's about the people. It's about how to get along with each other. That's the way it's supposed to be. And it's not always pretty. It can be hard to do.",
        "date": "2025-01-19",
        "location": "India",
        "keywords": [
            "rooms young",
            "rooms",
            "rare privacy",
            "indian lovers",
            "privacy"
        ]
    },
    {
        "complaint_number": 15,
        "summary": "A look at the state of the nation's health care system. A look at how the U.S. military is faring in Afghanistan. A peek into the world of the country's military. A glimpse of the world's military health system.",
        "date": "2025-01-30",
        "location": "India",
        "keywords": [
            "bjp auditor",
            "auditor issues",
            "issues independence",
            "bjp",
            "auditor"
        ]
    },
    {
        "complaint_number": 16,
        "summary": "The National Suicide Prevention Lifeline is at 1-800-273-8255. For confidential support on suicide matters call the Samaritans on 08457 90 90 90 or visit a local Samaritans branch, see www.samaritans.org for details.",
        "date": "2025-02-17",
        "location": "India",
        "keywords": [
            "downplays china",
            "china enemy",
            "china threat",
            "pitroda downplays",
            "enemy sam"
        ]
    },
    {
        "complaint_number": 17,
        "summary": "The author is the author of a new book, The Book Thief. The book tells the story of the author's life in the U.S. and abroad. The author is also a former journalist and author of several other books. For more information on the book, go to the book's website.",
        "date": "2025-02-23",
        "location": "India",
        "keywords": [
            "india real",
            "problems people",
            "india",
            "real problems",
            "problems"
        ]
    },
    {
        "complaint_number": 18,
        "summary": "The author of a book about her life in the U.S. says she has been through a lot. The author of the book says that she has experienced a lot in her life so far. She has also had to deal with the loss of her husband and children.",
        "date": "2025-02-20",
        "location": "India",
        "keywords": [
            "leave india",
            "want leave",
            "india",
            "leave",
            "want"
        ]
    },
    {
        "complaint_number": 19,
        "summary": "A.S.A. has a policy against the use of the word \"penetration\" in its advertising. The policy is based on the belief that the word 'penetrative' can be used to refer to a person's ability to control their own behavior.",
        "date": "2025-02-18",
        "location": "India",
        "keywords": [
            "pvr inox",
            "inox pay",
            "pvr",
            "directs pvr",
            "pay rs"
        ]
    },
    {
        "complaint_number": 20,
        "summary": "The author of a book about her life in the U.S. has been unable to find a job since leaving college. She now lives in California with her husband and two children. The book is about her journey through life in California and the United States.",
        "date": "2025-01-27",
        "location": "India",
        "keywords": [
            "indian citizenship",
            "renounce indian",
            "citizenship 10",
            "citizenship",
            "indian"
        ]
    },
    {
        "complaint_number": 21,
        "summary": "In the U.S. it is illegal to kill animals in the state of California. The state has banned the practice of killing animals in its territory. The law also prohibits the sale of animals to other states. In California, the law also applies to states that have not adopted the state's laws.",
        "date": "2025-02-09",
        "location": "India",
        "keywords": [
            "indian cities",
            "trains indian",
            "metro trains",
            "cities ignored",
            "larger mobility"
        ]
    },
    {
        "complaint_number": 22,
        "summary": "The author is the author of a new book, The Power of One. The book is about the power of one man to change the world. The author is also known as \"The Power Of One\" The book was published by Simon & Schuster, which is based in London.",
        "date": "2025-02-02",
        "location": "India",
        "keywords": [
            "warrant ramdev",
            "bailable arrest",
            "non bailable",
            "kerala court",
            "arrest warrant"
        ]
    },
    {
        "complaint_number": 23,
        "summary": "The author of the book, \"The Power of One,\" believes in the power of one person to change the world. The author also believes that the world needs more people who are willing to work hard for the greater good of the community.",
        "date": "2025-02-05",
        "location": "India",
        "keywords": [
            "obesity poster",
            "moh obesity",
            "churchil silhouette",
            "obesity",
            "uses churchil"
        ]
    },
    {
        "complaint_number": 24,
        "summary": "It's been a while since I've posted a picture of myself. Here's a look at how my life has changed in the last few years. I'm a little bit of a recluse, but I'm not a bad one. I like to be alone.",
        "date": "2025-01-12",
        "location": "India",
        "keywords": [
            "india untrustworthy",
            "fact india",
            "india",
            "untrustworthy",
            "hate fact"
        ]
    },
    {
        "complaint_number": 25,
        "summary": "It's been a long time since I've been in this position. It's been fun, but it's been hard to get used to. I've learned a lot about myself. I'm a little bit of a masochist.",
        "date": "2025-01-14",
        "location": "India",
        "keywords": [
            "toilet issue",
            "vande bharat",
            "bharat sleeper",
            "toilet",
            "inside rs"
        ]
    },
    {
        "complaint_number": 26,
        "summary": "The U.S. Army Corps of Engineers has been tasked with finding a solution to the country's economic woes. The agency has been trying to find a solution for more than a year. It has been struggling to find an answer to the problem of how to provide jobs for people who want them.",
        "date": "2025-02-14",
        "location": "India",
        "keywords": [
            "modi adani",
            "adani modi",
            "comment adani",
            "adani issue",
            "modi declines"
        ]
    },
    {
        "complaint_number": 27,
        "summary": "The U.S. military has been involved in a number of high-profile incidents in recent years. The U.N. has said it is working to improve the country's military readiness. The military is also working to reduce the number of troops stationed in the country.",
        "date": "2025-02-04",
        "location": "India",
        "keywords": [
            "indian passport",
            "passport entry",
            "passport",
            "indian",
            "entry"
        ]
    },
    {
        "complaint_number": 28,
        "summary": "The author of the book, The Book Thief, also wrote a book about the book. The book, published by Simon & Schuster, was published in 2007. It was the first time the author had been published in the U.S. since the 1950s.",
        "date": "2025-02-04",
        "location": "India",
        "keywords": [
            "girl anxiety",
            "argue navigation",
            "anxiety issues",
            "driver woman",
            "navigation issue"
        ]
    },
    {
        "complaint_number": 29,
        "summary": "A look at some of the things that have happened in the past week. A look at a few of the events that have occurred in the last few days. A peek into the future. A glimpse into the past. A little bit of the present. And a little of the future...",
        "date": "2025-02-18",
        "location": "India",
        "keywords": [
            "kiit university",
            "happened kiit",
            "kiit",
            "university",
            "summary happened"
        ]
    },
    {
        "complaint_number": 30,
        "summary": "The state of the state of California is in a state of emergency. The state is in the midst of an economic crisis. It is also in the middle of a power struggle with the federal government. It has been declared an emergency in the state.",
        "date": "2025-01-09",
        "location": "India",
        "keywords": [
            "lakh voters",
            "ec enrolled",
            "voter issue",
            "population maharashtra",
            "voter"
        ]
    },
    {
        "complaint_number": 31,
        "summary": "It's been a while since I've posted anything on my blog. Here's a look at what's been going on in my life. It's been an interesting few months for me and my family. I hope to share some of my experiences with you.",
        "date": "2025-02-13",
        "location": "India",
        "keywords": [
            "bizarre assam",
            "assam court",
            "assam",
            "summons man",
            "court summons"
        ]
    },
    {
        "complaint_number": 32,
        "summary": "The author of a book on the history of the U.S. military. The book is called \"The Godfather of the American Army\" The author of the book also wrote a book about the American military called The Godfather Of The American Army.",
        "date": "2025-02-24",
        "location": "India",
        "keywords": [
            "sanskrit taught",
            "sanskrit",
            "world sanskrit",
            "taught schools",
            "taught"
        ]
    },
    {
        "complaint_number": 33,
        "summary": "The U.S. military is the largest employer in the state of California. The state is home to the largest number of military personnel in the country. The military is also home to some of the world's largest employers. The U.N. has the largest military workforce in the world, followed by Germany.",
        "date": "2025-01-15",
        "location": "India",
        "keywords": [
            "issue russia",
            "war india",
            "ukraine war",
            "killed ukraine",
            "indian killed"
        ]
    },
    {
        "complaint_number": 34,
        "summary": "The author of the book ‘The Power of One’ was born in the UK and lives in the U.S. now. The author was raised in England and moved to the United States at the age of 12. He now lives in New York City and works as a writer.",
        "date": "2025-01-19",
        "location": "India",
        "keywords": [
            "warrant ramdev",
            "arrest warrant",
            "kerala court",
            "ramdev alleged",
            "warrant"
        ]
    },
    {
        "complaint_number": 35,
        "summary": "The author is the author of the book, The Book Thief, which is published by Simon & Schuster. For more information on the book and its contents, visit www.thebookthief.com. The book tells the story of a man's life in the aftermath of a car accident.",
        "date": "2025-01-18",
        "location": "India",
        "keywords": [
            "burglary spaniards",
            "bengaluru burglary",
            "spaniards sos",
            "spaniards",
            "burglary"
        ]
    },
    {
        "complaint_number": 36,
        "summary": "It is not uncommon to see people in the street wearing the same clothes every day. It is not unusual to see the same people in different clothes every single day. There is no need to wear the same outfit every day, it is just a fact.",
        "date": "2025-02-16",
        "location": "India",
        "keywords": [
            "ragging incidents",
            "cases ragging",
            "ragging",
            "incidents registered",
            "700 cases"
        ]
    },
    {
        "complaint_number": 37,
        "summary": "It's a lot of work, but it's worth it, says the author of the book. The book is called The Book of the Dead. It's a book of the dead, and the dead are the dead. The dead are dead.",
        "date": "2025-02-08",
        "location": "India",
        "keywords": [
            "darga structures",
            "temple darga",
            "middle roads",
            "roads",
            "temple"
        ]
    },
    {
        "complaint_number": 38,
        "summary": "It's been a long time since I've seen this side of the ocean. I'm so happy to be back in the U.S. I've missed this part of the country. It's been great. I love this country. I miss it.",
        "date": "2025-01-17",
        "location": "India",
        "keywords": [
            "think rabies",
            "rabies",
            "think"
        ]
    },
    {
        "complaint_number": 39,
        "summary": "The former president of the United States, George W. Bush, was killed in a car crash in 2004. Bush was the first American to die in the line of duty since World War II. He was also the first man to die of a heart attack in the war.",
        "date": "2025-01-26",
        "location": "India",
        "keywords": [
            "false complaint",
            "complaint police",
            "threatened false",
            "case false",
            "false case"
        ]
    },
    {
        "complaint_number": 40,
        "summary": "A look at some of the things you need to know to get the most out of a flight. A look at a few things you should know about the flight industry. A peek at some things you can do with a flight from the airport to the airport.",
        "date": "2025-01-10",
        "location": "India",
        "keywords": [
            "air india",
            "disappointing experience",
            "experience air",
            "extremely disappointing",
            "india"
        ]
    },
    {
        "complaint_number": 41,
        "summary": "It's a lot of work, but it's worth it, says the author of the book. The book is called \"The Book of the Dead\" It's about the dead and the dead. It's also about the living and dead.",
        "date": "2025-02-01",
        "location": "India",
        "keywords": [
            "fraudulent booking",
            "issue pickyourtrail",
            "pickyourtrail beware",
            "booking issue",
            "pickyourtrail"
        ]
    },
    {
        "complaint_number": 42,
        "summary": "The author is the author of a new book, The Book Thief. The book tells the story of the author's life in the U.S. and how he came to be. The author is also a writer, and the book is about her life in America.",
        "date": "2025-01-04",
        "location": "India",
        "keywords": [
            "disappointed dhruv",
            "dhruv rathee",
            "atul subhash",
            "subhash thoughts",
            "video atul"
        ]
    },
    {
        "complaint_number": 43,
        "summary": "There is no such thing as a perfect country. There is only one perfect country, and it is the United States of America. The U.S. of A. is the best country in the world. There are no perfect countries, and there is nosuch thing as an ideal.",
        "date": "2025-02-16",
        "location": "India",
        "keywords": [
            "modi 1st",
            "press conference",
            "modi",
            "pm modi",
            "solo press"
        ]
    },
    {
        "complaint_number": 44,
        "summary": "It's been more than a year since we last saw each other. It's been a long time since we've seen each other in person. We've been in touch with each other through the years. We hope to see each other again this year.",
        "date": "2025-01-31",
        "location": "India",
        "keywords": [
            "issues amazon",
            "amazon india",
            "refund issues",
            "refund",
            "amazon"
        ]
    },
    {
        "complaint_number": 45,
        "summary": "The state of the state of California is currently in disarray. The state is in the midst of a state of disarray, and the state is struggling to find a way out of the mess it has created. It is also in the middle of a major overhaul of its internal revenue collection system.",
        "date": "2025-02-27",
        "location": "India",
        "keywords": [
            "nadu problem",
            "tamil nadu",
            "nadu",
            "issue ugc",
            "tamil"
        ]
    },
    {
        "complaint_number": 46,
        "summary": "Chennai is home to one of the world's largest concentrations of people living in poverty. The city is also home to the largest concentration of people in the world living on a single income. It is estimated that 1 in 4 people live in poverty in the U.S.",
        "date": "2025-01-07",
        "location": "India",
        "keywords": [
            "mtc buses",
            "chennai mtc",
            "tickets mtc",
            "mtc introduces",
            "ticketing buses"
        ]
    },
    {
        "complaint_number": 47,
        "summary": "It's time to put an end to this nonsense. It's time for a change in the way we look at the world. It is time to stop this nonsense and start looking at what we can do to make things better. We can do it by working together.",
        "date": "2025-01-20",
        "location": "India",
        "keywords": [
            "complaints irctc",
            "overcharging passengers",
            "irctc vendors",
            "irctc",
            "vendors overcharging"
        ]
    },
    {
        "complaint_number": 48,
        "summary": "It's a lot of work, but it's worth it, says the man behind the scenes. He says it's the only way to get the best of both worlds. The man behind it is the man who runs his own business, he says.",
        "date": "2025-01-19",
        "location": "India",
        "keywords": [
            "crore indians",
            "03 crore",
            "email",
            "crore",
            "improved lives"
        ]
    },
    {
        "complaint_number": 49,
        "summary": "S.C. State University is the only school in the U.S. that does not allow students to attend classes. The school has been criticized for not allowing students to go to classes. It is also the only one in the state that allows students to take part in classes.",
        "date": "2025-02-19",
        "location": "India",
        "keywords": [
            "complaint gautam",
            "gautam adani",
            "adani ongoing",
            "serve complaint",
            "complaint"
        ]
    },
    {
        "complaint_number": 50,
        "summary": "It is not uncommon to see people who have served in the military in the U.S. military. It is also not uncommon for people to serve in the United States military after they have served there in the past or are currently serving there. This is not unusual.",
        "date": "2025-02-02",
        "location": "India",
        "keywords": [
            "debit frozen",
            "account frozen",
            "disappeared account",
            "account debit",
            "cyber fraud"
        ]
    },
    {
        "complaint_number": 51,
        "summary": "I.N.T.C.E.R.A.S.P.I.C., a.k.a. “Innocence of Love’s’’ is the name of a group of people who have fallen in love with each other. The group is made up of women who have been married for more than a decade.",
        "date": "2025-02-20",
        "location": "India",
        "keywords": [
            "obscene content",
            "platforms obscene",
            "ott platforms",
            "advisory ott",
            "ott"
        ]
    },
    {
        "complaint_number": 52,
        "summary": "It's not just you, it's me, too. It's the way we live. The way we look at each other. We're all in this together. We are all in it together. And we're not in it for the money.",
        "date": "2025-02-19",
        "location": "India",
        "keywords": [
            "hindi imposition",
            "indian issue",
            "south indian",
            "north indian",
            "hindi"
        ]
    },
    {
        "complaint_number": 53,
        "summary": "It's been a while since I've posted anything on this site. I'm happy to make it clear that I'm not looking for attention. I just want people to know that I don't want to be seen as a bad person. It's just that I do want to make sure that people don't think I'm a bad guy.",
        "date": "2025-02-21",
        "location": "India",
        "keywords": [
            "visually impaired",
            "indian currency",
            "impaired citizens",
            "impaired",
            "using indian"
        ]
    },
    {
        "complaint_number": 54,
        "summary": "It's time to get rid of the old ways of doing things. It's time for the new ways to do things. The old ways are time to go. The new ways are called \"the new ways\" and \"the old ways\" are time-saving.",
        "date": "2025-02-17",
        "location": "India",
        "keywords": [
            "74th amendment",
            "amendment",
            "amendment key",
            "civic issues",
            "74th"
        ]
    },
    {
        "complaint_number": 55,
        "summary": "The author is the author of a book about the history of the U.S. military. The book is called The Godfather of the American Soldier. The author is also known for his work in the field of public relations. The writer is also the creator of the book The God Father of the United States.",
        "date": "2025-02-06",
        "location": "India",
        "keywords": [
            "karnataka bitcoin",
            "bitcoin scam",
            "scam sit",
            "karnataka",
            "bitcoin"
        ]
    },
    {
        "complaint_number": 56,
        "summary": "The author of this article is also the author of the book, \"The Secret Life of the American Dream\" The book is published by Simon & Schuster and is available on Amazon.com. For more information, visit www.thesecretlifeoftheamericandream.co.uk.",
        "date": "2025-01-02",
        "location": "India",
        "keywords": [
            "verification bgv",
            "background verification",
            "bgv issue",
            "checkr need",
            "checkr"
        ]
    },
    {
        "complaint_number": 57,
        "summary": "The author of a book about the U.S. invasion of Iraq says that the war on terror is not over. The author of the book says the war is still on and that it will continue for some time to come. The book is called \"The War on Terror\" and is published by Harper Collins.",
        "date": "2025-01-28",
        "location": "India",
        "keywords": [
            "mtv ad",
            "sister india",
            "best mtv",
            "mtv",
            "india best"
        ]
    },
    {
        "complaint_number": 58,
        "summary": "It's a lot of work, but it's worth it. It's the only way to get along with the people. It'll be a long time before you can call it a day. You'll have to wait and see how it goes.",
        "date": "2025-02-07",
        "location": "India",
        "keywords": [
            "epfo",
            "epfo joke",
            "rant withdrawing",
            "withdrawing money",
            "withdrawing"
        ]
    },
    {
        "complaint_number": 59,
        "summary": "It's been a long time since I've seen this kind of thing. It's been fun to watch. I've been watching a lot of TV. It was fun to see how far I've come. I'm glad I'm no longer in the dark ages.",
        "date": "2025-01-10",
        "location": "India",
        "keywords": [
            "indian banksy",
            "indian street",
            "banksy",
            "time indian",
            "banksy list"
        ]
    },
    {
        "complaint_number": 60,
        "summary": "It's been a long time since I've seen this kind of thing happen. It's been fun to watch. But now it's time to get back to business as usual. I'm not sure how much longer I can keep this up.",
        "date": "2025-01-10",
        "location": "India",
        "keywords": [
            "complaint order2india",
            "order2india portal",
            "consumer complaint",
            "order2india",
            "shadowfax delivery"
        ]
    },
    {
        "complaint_number": 61,
        "summary": "It's been a long time since I've seen such a thing happen. It's a little embarrassing. But it's a good thing I'm not in the military. It means I don't have to do this anymore. I'm so glad I didn't do this to myself.",
        "date": "2025-01-28",
        "location": "India",
        "keywords": [
            "opinion china",
            "ahead india",
            "india careful",
            "china leaps",
            "unpopular opinion"
        ]
    },
    {
        "complaint_number": 62,
        "summary": "The National Suicide Prevention Lifeline can be reached at 1-800-273-8255. For confidential support call the Samaritans on 08457 90 90 90 or visit a local Samaritans branch, see www.samaritans.org for details.",
        "date": "2025-01-06",
        "location": "India",
        "keywords": [
            "himachal rainfall",
            "weather update",
            "fog warning",
            "dense fog",
            "rainfall"
        ]
    },
    {
        "complaint_number": 63,
        "summary": "The National Suicide Prevention Lifeline can be found at www.suicidepreventionlifeline.org. The national suicide prevention Lifeline is also available on Facebook at: www.facebook.com/sophisticationlifeline/. For confidential support call the Samaritans on 08457 909090 90 90 90, visit a local Samaritans branch or click here.",
        "date": "2025-01-28",
        "location": "India",
        "keywords": [
            "kris gopalakrishnan",
            "gopalakrishnan 18",
            "infosys founder",
            "gopalakrishnan",
            "founder kris"
        ]
    },
    {
        "complaint_number": 64,
        "summary": "The author of a book about how to get your hands on some of the world’s most expensive real estate. The author of the book also wrote a book on how to make money off of your real estate investments. The book is called ‘The Art of Getting Your Hands On Real Estate’.",
        "date": "2025-01-14",
        "location": "India",
        "keywords": [
            "crocs",
            "sent crocs",
            "crocs straight",
            "cow shed",
            "cow"
        ]
    },
    {
        "complaint_number": 65,
        "summary": "It's been a long time since I've seen this side of the ocean. It's been fun to watch. But now it's time to get back to work. I've got a lot of work to do. I can't wait to get to work!",
        "date": "2025-01-02",
        "location": "India",
        "keywords": [
            "corrupt gst",
            "gst officer",
            "gst",
            "corrupt",
            "officer"
        ]
    }
]